import tkinter as tk
from tkinter import font as tkfont
from tkinter import ttk
import random

# config main value
values = "fix","tie", "slide", "key", "battery", "air","painting" ,"film" ,"mirror"

def generate_random_string():
    """Generates a random string based on user input and displays it."""
    try:
        desired_length = int(entry_length.get())
        result_string = ""

        # Define the fixed words that must always be included if the checkbox is selected
        fixed_words = {
            "fix": ["ซ่อมรถนอกสถานที่","อู่ซ่อมรถใกล้ฉัน","รถเสีย","ช่างซ่อมนอกสถานที่",],
            "tie": ["ปะยาง","เปลี่ยนยาง","ร้านยาง","ปะยางใกล้ฉัน","เปลี่ยนยางใกล้ฉัน","ร้านยางใกล้ฉัน","ช่างปะยาง"],
            "slide": ["รถสไลด์", "รถยก", "รถลาก"],
            "key": ["กุญแจรถ","ร้านกุญแจใกล้ฉัน","สะเดาะกุญแจ","รถล็อค","ทำกุญแจ","ปั๊มกุญแจ","กุญแจรีโมท","กุญแจบ้าน","ช่างกุญแจ"],
            "battery": ["แบตเตอรี่","สตาร์ทไม่ติด","ไดสตาร์ทเสีย","จั๊มแบต","เปลี่ยนแบต","พ่วงแบต","ร้านแบตใกล้ฉัน","ไฟแบตโชว์"],
            "air":["แอร์รถยนต์ไม่เย็น","ล้างแอร์รถยนต์","แอร์รถยนต์รั่ว","เติมน้ำยาแอร์รถยนต์",
                   "ช่างแอร์รถยนต์","ร้านแอร์รถยนต์","ร้านแอร์รถยนต์ใกล้ฉัน","ล้างแอร์รถยนต์นอกสถานที่","ล้างแอร์ไม่ถอดตู้","ล้างแอร์ถอดตู้"],
            "painting":["ทำสีรถ","พ่นสีรถ","ซ่อมสีรถ","เคลือบสีรถ","ตัวถังรถยนต์","ขัดสีรถ","ซ่อมรอยขีดข่วน","ทำสีรอบคันรถ",],
            "film":["ฟิล์มกรองแสงรถยนต์","ฟิล์มรถเซรามิค","ฟิล์มรถกันความร้อน","ติดฟิล์มรถยนต์","ฟิล์มใส","ฟิล์มรถราคาถูก","ฟิล์มกันรอยรถยนต์","ร้านติดฟิล์มรถ"],
            "mirror":["ซ่อมกระจกรถใกล้ฉัน","กระจกรถแตก","กระจกรถร้าว","เปลี่ยนกระจกรถยนต์","ซ่อมกระจกรถด่วน","เปลี่ยนกระจกข้าง"],
        }

        # Define word lists specific to each category
        word_lists = {
            "fix": [
                "อู่ซ่อมรถใกล้ฉัน", "อู่ซ่อมรถจักรยานยนต์ใกล้ฉัน", "อู่รถยนต์ใกล้ฉัน", "เกียร์ออโต้", "ซ่อมรถนอกสถานที่", "รถเสีย", "เครื่องยนต์", "เบรก", "เกียร์", "ช่วงล่าง", 
                "ผ้าเบรครถยนต์ราคา", "ซ่อมรถนอกสถานที่ใกล้ฉัน", "อู่ซ่อมกระจกรถยนต์ใกล้ฉัน", "อู่ซ่อมเครื่องรถยนต์ใกล้ฉัน", "ผ้าเบรครถยนต์", "อู่ซ่อมรถนอกสถานที่ใกล้ฉัน", "อู่ทำสีรถใกล้ฉัน", 
                "อู่ซ่อมรถใหญ่ใกล้ฉัน", "อู่ซ่อมรถยนต์มาตรฐานใกล้ฉัน", "ผ้าเบรคbendix", "ราคา ผ้าเบรครถยนต์", "ผ้าเบรคนexzter", "เครื่องยนต์ดีเซล", "น้ำมันเกียร์", "อู่ซ่อมรถเคลมประกันวิริยะใกล้ฉัน", 
                "อู่ในเครือทิพยประกันภัยใกล้ฉัน", "เครื่องยนต์4จังหวะ", "น้ำมันเกียร์cvt", "น้ำมันเกียร์ออโต้", "ช่วงล่างรถยนต์", "เครื่องยนต์เบนซิน", "อู่เคลมประกันใกล้ฉัน", "ฟอกเกียร์", "เครื่องยนต์อเนกประสงค์", 
                "อู่ในเครือสินมั่นคงใกล้ฉัน", "น้ำมันเกียร์atf", "อู่ซ่อมรถใกล้ๆฉัน", "cvtคือ", "ช่วงล่างรถยนต์", "ดรัมเบรก", "รถจักรยานยนต์เกียร์ออโต้", "รถยนต์เกียร์ธรรมดา", "อู่ซ่อมรถยนต์ใกล้ๆฉัน", "เกียร์กระปุก", 
                "เกียร์ธรรมดา", "เกียร์รถยนต์", "เกียร์รถยนต์ออโต้", "เครื่องยนต์", "เครื่องยนต์2จังหวะ", "เครื่องยนต์รถ", "เครื่องยนต์โรตารี่", "เบรก", "เบรกรถยนต์", "เบรก", "เพลาลูกเบี้ยว", "แรงม้าคือ", 
                "ช่างซ่อมรถนอกสถานที่", "นิสสันนาวาร่าแคปเกียร์ออโต้", "suzuki carryเกียร์ออโต้", "ราคา ผ้าเบรค", "อู่ซ่อมรถในเครือทิพยประกันภัยใกล้ฉัน", "ช่างซ่อมรถนอกสถานที่ใกล้ฉัน", "ราคา ผ้าเบรครถเก๋ง", 
                "มิตซูบิชิ มิราจเกียร์ออโต้ราคา", "อู่ซ่อมฮอนด้าใกล้ฉัน", "ราคา ผ้าเบรครถยนต์toyota", "อู่ซ่อมรถเมืองไทยประกันภัยใกล้ฉัน", "บริการซ่อมรถนอกสถานที่", "รับซ่อมรถนอกสถานที่", "ช่างซ่อมรถยนต์นอกสถานที่", 
                "suzuki carryเกียร์ออโต้ราคา", "ผ้าเบรคราคา", "อู่ทิพยประกันภัยใกล้ฉัน", "อู่ซ่อมรถโตโยต้าราคา", "บริการซ่อมรถนอกสถานที่ใกล้ฉัน", "ซ่อมรถนอกสถานที่24ชั่วโมง", "ช่างรถยนต์นอกสถานที่ใกล้ฉัน", "เกียร์ออโต้ฟอร์ดเรนเจอร์", 
                "ผ้าเบรครถยนต์ราคาเท่าไหร่", "อู่ซ่อมเครื่องยนต์ใกล้ฉัน", "ร้านซ่อมรถนอกสถานที่ใกล้ฉัน", "ฟลัชชิ่งเกียร์ใกล้ฉัน", "รับซ่อมรถนอกสถานที่ใกล้ฉัน", "ผ้าเบรคcompact", "เบรกรถยนต์ราคา", "เครื่องยนต์cummins", 
                "ผ้าเบรคbendixราคา", "atf wsเทียบเท่า", "bigเบรคซิ่ง", "civic fdเกียร์ธรรมดา", "civicเกียร์ธรรมดา", "flushing oilคือ", "honda citytypezเกียร์ออโต้", "hondaเกียร์ออโต้", "isuzu nlr 130เกียร์ออโต้", 
                "msx 5เกียร์", "revo5เกียร์กับ6เกียร์", "suzuki carryเกียร์ออโต้pantip", "toyota hiaceเกียร์ออโต้", "vtecคือ", "vvtiคือ", "yamahaเกียร์ออโต้", "yanmar tf120diราคา", "กระบอกสูบรถยนต์", "กระบอกสูบเครื่องยนต์", 
                "กระปุกเกียร์ธรรมดา", "คลัชเกียร์ออโต้", "คันเร่งรถยนต์เกียร์ธรรมดา", "คูโบต้azt120ราคา", "จารบีทาสลักเบรก", "ชผ้าเบรค", "ช่วงล่างdmaxhilander", "ช่วงล่างถุงลม", "ช่วงล่างรถกระบะ", "ช่วงล่างรถกระบะisuzuราคา", 
                "ช่วงล่างรถเก๋ง", "ช่วงล่างวีโก้ตัวเตี้ย", "ดรัมเบรก", "ดรัมเบรกหลัง", "ดรัมเบรกหลังรถยนต์", "ดีเซลกับเบนซิน", "ตัวธรรมดา", "ถอยหลังเกียร์ออโต้", "ทอร์คเกียร์", "ทอร์คเกียร์ออโต้", "ทำเบรก", "นิสสันnvเกียร์ออโต้", 
                "น้ำมันatf", "น้ำมันเกียร์aisinดีไหมpantip", "น้ำมันเกียร์alpha", "น้ำมันเกียร์atf ws", "น้ำมันเกียร์auto", "น้ำมันเกียร์bt50ตัวเก่า", "น้ำมันเกียร์civicfb", "น้ำมันเกียร์cvttoyota", "น้ำมันเกียร์cvttoyotayaris", 
                "น้ำมันเกียร์dexron2ต่างกัน dexron3", "น้ำมันเกียร์fordranger", "น้ำมันเกียร์fordranger2006", "น้ำมันเกียร์fortuner", "น้ำมันเกียร์hondacity2012", "น้ำมันเกียร์hrv", "น้ำมันเกียร์isuzudmax", "น้ำมันเกียร์ptt", "น้ำมันเกียร์tfr", 
                "น้ำมันเกียร์toyotarevo", "น้ำมันเกียร์ฟอร์ดเรนเจอร์2.2", "น้ำมันเกียร์รถยนต์", "น้ำมันเกียร์ออโต้atf", "น้ำมันเกียร์ออโต้isuzu", "น้ำมันเกียร์อัตโนมัติ", "น้ำมันเฟืองท้ายhonda", "น้ำมันเฟืองท้ายนมอตุล", "น้ำมันเครื่องแห้งเร็ว มอเตอร์ไซค์", 
                "บริการซ่อมรถยนต์นอกสถานที่", "บิ๊กไบค์เกียร์ออโต้", "ปผ้าเบรค", "ปั้มเบรคฟอร์จูนเนอร์", "ปั้มเบรครถยนต์isuzu", "ผ้าเบรค5uz", "ผ้าเบรคadvics", "ผ้าเบรคbendixtoyota", "ผ้าเบรคcompactprimo", "ผ้าเบรคcompactกับbendix", 
                "ผ้าเบรคdixcel", "ผ้าเบรคfordranger", "ผ้าเบรคgrandfilano", "ผ้าเบรคhondacity", "ผ้าเบรคisuzu1.9ราคา", "ผ้าเบรคjazzgk", "ผ้าเบรคmazda2", "ผ้าเบรคmgzs", "ผ้าเบรคนmax", "ผ้าเบรคpcx160", "ผ้าเบรคrevo", 
                "ผ้าเบรคtoyotaviosแท้", "ผ้าเบรคtrw", "ผ้าเบรคtrwกับbendix", "ผ้าเบรคtrwดีไหมpantip", "ผ้าเบรคคือ", "ผ้าเบรคปักข้าง", "ผ้าเบรคฟอร์ดเรนเจอร์", "ผ้าเบรคภาษาอังกฤษ", "ผ้าเบรครถบรรทุก", "ผ้าเบรครถบรรทุกisuzu", 
                "ผ้าเบรครถเก๋งราคา", "ผ้าเบรครถยนต์isuzu", "ผ้าเบรคราคาเท่าไหร่", "ผ้าเบรครีโว่", "ผ้าเบรคหน้า", "ผ้าเบรคหน้าฟอร์ซ่า350", "ผ้าเบรคหน้ากรานด์ฟิลานอ", "ผ้าเบรคหน้านmax", "ผ้าเบรคหน้ารถยนต์", "ผ้าเบรคหน้าที่", "ผ้าเบรคหมด", 
                "ผ้าเบรคหมดราคา", "ผ้าเบรคหลังgrandfilano", "ผ้าเบรคอากิโมโน", "ผ้าเบรคอีซูซุ", "ผ้าเบรคเบนดิก", "ผ้าเบรคเบนดิกซ์ราคา", "ผ้าเบรคใกล้ฉัน", "พระโขนงผ้าเบรค", "ฟลัชชิ่งเกียร์บีควิกราคา", "ฟอกเกียร์ราคา", "ฟอกเกียร์ใกล้ฉัน", 
                "ฟอร์จูนเนอร์เกียร์ธรรมดา", "ยกเครื่องใหม่isuzuราคา", "รถขึ้นabs", "รถเครื่องยนต์เบนซิน", "รถเบนซิน", "รถเบรก", "รถยนต์ยี่ห้อKia", "รถยนต์ยี่ห้อเกียร์", "รถยนต์เกียร์กระปุก", "รถยนต์เบรกไม่อยู่", "ระบบช่วงล่าง", "ราคา ผ้าเบรคHondaCity",
                  "ราคา ผ้าเบรครถยนต์Honda", "ราคา ผ้าเบรครถยนต์Isuzu", "ราคา ผ้าเบรครถยนต์ToyotaAltis", "ราคา ผ้าเบรครถยนต์ToyotaRevo", "ราคา ผ้าเบรคหน้ารถยนต์", "ราคา ผ้าเบรคหลังรถยนต์Toyota", "ราคาเครื่องคูโบต้า", 
                  "ราคาเครื่องยนต์", "ร้านซ่อมรถนอกสถานที่", "ร้านซ่อมรถใกล้ฉันรถยนต์", "ร้านซ่อมแอร์ไดนาโมใกล้ฉัน", "ร้านอู่ซ่อมรถใกล้ฉัน", "ร้านไดนาโมใกล้ฉันที่สุด", "ลูกสูบ2จังหวะ", "ลูกสูบคือ", "ลูกสูบรถมอเตอร์ไซค์", "ลูกสูบเบรคหลัง", 
                  "วีออส2013รุ่นeเกียร์ออโต้", "วีออสเกียร์ธรรมดา", "สายเบรคhel", "สายเบรคถัก", "สายเบรคเอิร์นแท้", "สาเหตุ น้ำมันเกียร์ออโต้รั่ว", "ส่วนประกอบดรัมเบรก", "ส่วนประกอบเครื่องยนต์", "ส่วนประกอบเครื่องยนต์4จังหวะมอเตอร์ไซค์", 
                  "ส่วนประกอบเครื่องยนต์ดีเซล", "ส่วนประกอบเครื่องยนต์เล็กดีเซล", "ออยเกียร์fordranger", "ออยเกียร์toyota", "อากีร่6เกียร์", "อู่ซ่อมHondaใกล้ฉัน", "อู่ซ่อมToyotaใกล้ฉัน", "อู่ซ่อมกรุงเทพประกันภัยใกล้ฉัน", "อู่ซ่อมรถกรุงเทพประกันภัยใกล้ฉัน", 
                  "อู่ซ่อมรถทิพยประกันภัยใกล้ฉัน", "อู่ซ่อมรถที่ใกล้ฉัน", "อู่ซ่อมรถนอกสถานที่", "อู่ซ่อมรถMazdaใกล้ฉัน", "อู่ซ่อมรถมิตรแท้ประกันภัยใกล้ฉัน", "อู่ซ่อมรถวิริยะใกล้ฉัน", "อู่ซ่อมรถเครื่องใกล้ฉัน", "อู่ซ่อมรถใกล้ฉันที่สุด", "อู่ซ่อมรถใกล้ฉันวิริยะ", 
                  "อู่ซ่อมรถใกล้ตัวฉัน", "อู่ซ่อมวิริยะใกล้ฉัน", "อู่ซ่อมใกล้ฉัน", "อู่ทำรถยนต์ใกล้ฉัน", "อู่ประกันใกล้ฉัน", "อู่Mazdaใกล้ฉัน", "อู่เครื่องยนต์ใกล้ฉัน", "ฮอนด้าเกียร์ออโต้", "เกียร์ถอยหลัง", "เกียร์1", "เกียร์110i", "เกียร์2", "เกียร์2คือ", "เกียร์at", 
                  "เกียร์atคือ", "เกียร์atf", "เกียร์atfคือ", "เกียร์auto", "เกียร์btoyotacrossคือ", "เกียร์btoyotaคือ", "เกียร์bmw", "เกียร์cvt", "เกียร์cvthonda", "เกียร์cvtกระตุก", "เกียร์cvtคือ", "เกียร์dct", "เกียร์dctคือ", "เกียร์honda", 
                  "เกียร์m", "เกียร์mmazda2คือ", "เกียร์mคือ", "เกียร์manual", "เกียร์mt", "เกียร์mtคือ", "เกียร์sกับl", "เกียร์กระตุก", "เกียร์กระตุกกระชาก", "เกียร์ถอยออโต้", "เกียร์ทอร์ค", "เกียร์ธรรมดา6สปีดisuzu", "เกียร์ธรรมดาคือ", 
                  "เกียร์ฝากสามล้อ", "เกียร์พัง", "เกียร์พังซ่อมเท่าไหร่", "เกียร์ฟอร์จูนเนอร์", "เกียร์ยาริส", "เกียร์รถยนต์ธรรมดา", "เกียร์รถไฟฟ้า", "เกียร์ว่างออโต้", "เกียร์หลุด", "เกียร์ออโต้", "เกียร์ออโต้honda", "เกียร์ออโต้กระตุก", "เกียร์ออโต้กระตุกhonda",
                    "เกียร์ออโต้คือ", "เกียร์ออโต้พังราคา", "เกียร์ออโต้ยาริส", "เกียร์ออโต้รูด", "เกียร์ออโต้ลื่น", "เกียร์ออโต้เข้าเกียร์dกระตุก", "เกียร์ออโต้เข้าเกียร์ไม่ได้", "เกียร์ออโต้โตโยต้ายาริส", "เกียร์ออโต้โตโยต้าวีออส", "เกียร์อัตโนมัติ", "เกียร์เดินหน้า", 
                    "เกียร์เดินหน้าถอยหลัง", "เกียร์แข็งเข้าเกียร์ยาก", "เกียร์แมนวล", "เกียร์โฟวิล", "เกียร์โฟวิลmitsubishi", "เกียร์โฟวิลtoyota", "เกียร์โยง", "เกียร์โยงคือ", "เกียร์โยงแดช", "เกียร์ไฟฟ้า", "เข้าเกียร์ออโต้", "เข้าเกียร์ไม่ได้เกียร์ออโต้", 
                    "เครื่องดีเซลเล็ก", "เครื่องสเตอร์ลิง", "เครื่องอเนกประสงค์13แรง", "เครื่องฮอนด้า", "เครื่องเทอร์โบ", "เครื่องเบนซินฮอนด้า", "เครื่องโตโยต้า", "เครื่องยนต์13แรง", "เครื่องยนต์1jz", "เครื่องยนต์2จังหวะและ4จังหวะ", "เครื่องยนต์2j", 
                    "เครื่องยนต์2jz", "เครื่องยนต์3uz", "เครื่องยนต์4จังหวะhonda", "เครื่องยนต์4จังหวะคือ", "เครื่องยนต์4jj", "เครื่องยนต์f1", "เครื่องยนต์gx160", "เครื่องยนต์honda", "เครื่องยนต์hondagx160", "เครื่องยนต์hondagx200", "เครื่องยนต์sr20", 
                    "เครื่องยนต์tazawa", "เครื่องยนต์td27", "เครื่องยนต์toyota", "เครื่องยนต์v6", "เครื่องยนต์vtec", "เครื่องยนต์vvti", "เครื่องยนต์คอมมอนเรล", "เครื่องยนต์คัมมิสนส์", "เครื่องยนต์คือ", "เครื่องยนต์คูโบต้าราคา", "เครื่องยนต์ดีเซล2จังหวะ", 
                    "เครื่องยนต์ดีเซล4จังหวะ", "เครื่องยนต์ดีเซลมือสองtoyota", "เครื่องยนต์ดีเซลเชียงกงราคา", "เครื่องยนต์ยันม่า", "เครื่องยนต์ยันมาร์", "เครื่องยนต์สองจังหวะ", "เครื่องยนต์หลวม", "เครื่องยนต์อเนกประสงค์honda", "เครื่องยนต์อเนกประสงค์ดีเซล", 
                    "เครื่องยนต์ฮอนด้า13แรง", "เครื่องยนต์ฮอนด้า5.5แรง", "เครื่องยนต์เบนซิน13แรง", "เครื่องยนต์เบนซิน4จังหวะ", "เครื่องยนต์เบนซิน5.5แรง", "เครื่องยนต์เบนซินรถยนต์", "เครื่องยนต์เบนซินอเนกประสงค์", "เครื่องยนต์เพลาคว่ำ", "เครื่องยนต์เร่งไม่ขึ้น", 
                    "เครื่องยนต์เล็ก", "เครื่องยนต์เล็กดีเซล", "เครื่องยนต์โรตารี่คือ", "เครื่องยนต์ไดเร็ค", "เดินหน้าเกียร์ออโต้"
            ],
            "tie": [
                # "เปลี่ยนยางรถยนต์", "ซ่อมยางรถยนต์", "เติมลมยาง", "ตั้งศูนย์ถ่วงล้อ", "ถ่วงล้อ", 
                # "ปะยางนอกสถานที่", "ปะยางใกล้ฉัน", "ร้านยางรถยนต์", "บริการยางรถยนต์นอกสถานที่", 
                # "วิธีเปลี่ยนยางรถยนต์", "สาเหตุยางรั่ว", "สาเหตุยางระเบิด", "วิธีป้องกันยางสึก", "วิธีดูแลรักษายางรถยนต์", 
                # "วิธีเติมลมยางรถยนต์", "วิธีตั้งศูนย์ถ่วงล้อ", "ควรเปลี่ยนยางรถยนต์เมื่อไหร่", "เปลี่ยนยางนอกสถานที่",
                # "ร้านยางนอกสถานที่","เปลียนยางใกล้ฉัน","ยางเสีย","ยางดอกหมด","ยางไม่มีลม","ลมยางอ่อน","ยางแบน","ยางรั่ว"
                # ,"ยางระเบิดข้างทาง","ล้อหลุด","ยางสั่น","ยางกินเนื้อ","เติมลมยางไม่เข้า","ช่างซ่อมยางรถยนต์","ยางมีรอยรั่ว"
                # ,"ตะปูทิ่มยาง","ยางปูด","ยางรถยนต์ ราคา","เปลี่ยนยางราคาถูก","ปะยางราคาถูก","เติมลมยางราคาถูก"
                # ,"เปลี่ยนล้อราคาถูก","ซ่อมแซมยางราคาถูก","เบอร์โทรร้านยาง","เบอร์โทรชางเปลี่ยนยาง","เบอร์โทรช่างปะยาง"
                # ,"ร้านขายยางรถยนต์","บริการถึงที่","ซ่อมนอกสถานที่","24 ชั่วโมง","เปลี่ยนยางฉุกเฉิน","ปะยางฉุกเฉิน"
                # ,"เติมลมยางฉุกเฉิน"," แก้มยางร้าว","ดอกยางบาง","เปลี่ยนยางทำยังไง","ร้านนอกสถานที่","เปลี่ยนยางรถใหญ่"
                # ,"เปลี่ยนยางรถเก๋ง","เปลี่ยนยางรถกระบะ","เปลี่ยนยางอะไหล่","ปะยางรถใหญ่","ปะยางรถเก๋ง","ปะยางรถกระบะ","ซ่อมแซมยางยนต์"

                "ปะยางใกล้ฉัน", "ร้านยาง", "ปะยาง", "ร้านยางใกล้ฉัน", "ร้านปะยางใกล้ฉัน", "ร้านเปลี่ยนยางรถยนต์ใกล้ฉัน", "ร้านยางรถยนต์ใกล้ฉัน", 
                "ร้านปะยางรถยนต์ใกล้ฉัน", "เปลี่ยนยางรถยนต์", "ปะยางรถยนต์ใกล้ฉัน", "ร้านปะยาง", "ร้านปะยางรถยนต์24ชมใกล้ฉัน", "ร้านยางรถยนต์", 
                "ปะยางรถใกล้ฉัน", "ร้านยางจักรยานยนต์", "ร้านเปลี่ยนยางรถใกล้ฉัน", "เปลี่ยนยางรถยนต์", "ปะยางนอกสถานที่", "เปลี่ยนยางรถยนต์ใกล้ฉัน", 
                "ปะยางนอกสถานที่ใกล้ฉัน", "เปลี่ยนยางรถยนต์ราคา", "ร้านยางวงเวียน22", "ร้านปะยางใกล้ฉันเปิดตอนนี้", "ปะยางรถยนต์", "ร้านยางรถยนต์ใกล้ฉันราคา ถูก", 
                "ปะยาง24ชม", "ร้านปะยางใกล้ฉัน24ชม", "ปะยางรถยนต์ราคา", "ร้านเปลี่ยนยางรถยนต์", "ร้านปะยางนอกสถานที่ใกล้ฉัน", "เปลี่ยนยางรถยนต์4เส้นราคา", 
                "ซ่อมรถนอกสถานที่ใกล้ฉัน", "ร้านปะยางมอเตอร์ไซค์24ชมใกล้ฉัน", "ร้านขายยางรถยนต์ใกล้ฉัน", "ปะยาง24ชมใกล้ฉัน", "ร้านขายยางรถยนต์", 
                "เปลี่ยนยางนอกสถานที่ใกล้ฉัน", "ร้านปะยางนอกสถานที่", "อู่ซ่อมรถนอกสถานที่ใกล้ฉัน", "ร้านยางmaxxisใกล้ฉัน", "ร้านปะยางที่ใกล้ที่สุด", 
                "ร้านยางใกล้ฉันราคา ถูก", "เปลี่ยนยางรถยนต์1เส้นราคา", "ร้านปะยางรถใหญ่ใกล้ฉัน", "ร้านเปลี่ยนยาง", "ร้านปะยาง24ชมใกล้ฉัน", "เปลี่ยนยางใกล้ฉัน", 
                "ร้านยางเปอร์เซ็นต์ใกล้ฉัน", "ร้านปะยางรถยนต์", "ร้านเปลี่ยนยางใกล้ฉัน", "ร้านปะยางใกล้ๆฉัน", "ร้านยางมอเตอร์ไซค์ใกล้ฉัน", "ร้านปะยางรถบรรทุกใกล้ฉัน", 
                "ร้านตั้งศูนย์ถ่วงล้อใกล้ฉัน", "ร้านยางรถบรรทุกใกล้ฉัน", "ร้านยางโอ ตา นิใกล้ฉัน", "ปะยางนอกสถานที่24ชม", "ปะยางมอเตอร์ไซค์ใกล้ฉัน", "ร้านปะยาง24ชั่วโมง", 
                "ปะยางนอกสถานที่24ชั่วโมง", "ร้านขายยางมอเตอร์ไซค์ใกล้ฉัน", "ร้านยางมือสองใกล้ฉัน", "ร้านรับซื้อยางเก่าใกล้ฉัน", "ปะยางมอเตอร์ไซค์", 
                "ร้านยางบิ๊ ก ไบ ค์ใกล้ฉัน", "ปะยางใกล้ฉัน24ชม", "ปะยางสตรีม", "ปะยางแบบสตรีม", "ร้านปะยางรถบรรทุก", "ร้านยางมอเตอร์ไซค์", "ปะยางรถยนต์", 
                "รถยนต์ยางรั่ว", "ร้านขายยางรถ", "ร้านปะยางนอกสถานที่24ชม", "ร้านปะยางมอไซ", "ร้านปะยางรถยนต์", "ร้านยางมือสอง", "ร้านเติมลมไนโตรเจนใกล้ฉัน", 
                "ร้านเปลี่ยนยางมอไซค์ใกล้ฉัน", "ร้านเปลี่ยนยางมอเตอร์ไซค์", "เปลี่ยนยางมอเตอร์ไซค์ราคา", "เปลี่ยนยางรถใกล้ฉัน", "เปลี่ยนยางในรถมอไซค์ราคา", 
                "เปลี่ยนยางนอกสถานที่", "เปลี่ยนยางรถยนต์4ล้อราคา", "รับปะยางนอกสถานที่ใกล้ฉัน", "รับปะยางนอกสถานที่", "ช่างซ่อมรถนอกสถานที่", "บริการเปลี่ยนยางนอกสถานที่", 
                "รับเปลี่ยนยางนอกสถานที่", "โปรโมชั่นเปลี่ยนยางบีควิก2566", "ร้านผ่อนยางรถยนต์ใกล้ฉัน", "เปลี่ยนยางบีควิก", "โปรเปลี่ยนยาง", 
                "บริการปะยางนอกสถานที่", "เปลี่ยนยางรถยนต์นอกสถานที่ใกล้ฉัน", "ปะยางรถยนต์นอกสถานที่", "ราคาปะยางรถยนต์", "โปรโมชั่นเปลี่ยนยาง", 
                "เปลี่ยนยางรถยนต์ราคาเท่าไหร่", "ร้านยางรถยนต์ราคา ถูก", "ปะยางนอกสถานที่ราคา", "ปะยางรถยนต์นอกสถานที่ใกล้ฉัน", "บริการปะยางนอกสถานที่ใกล้ฉัน", 
                "เปลี่ยนยางรถยนต์ราคาบีควิก", "ช่างซ่อมรถนอกสถานที่ใกล้ฉัน", "เปลี่ยนยางรถยนต์นอกสถานที่", "เปลี่ยนยางรถยนต์ราคา ถูก", "ร้านยางรามอินทรา", 
                "ร้านยางราคา ถูก", "ร้านปะยางใกล้ฉันนอกสถานที่", "ศูนย์เปลี่ยนยางรถยนต์", "ร้านยางราคา ถูกใกล้ฉัน", "ช่างปะยางนอกสถานที่", "เปลี่ยนยางbquik", 
                "เปลี่ยนยางบีควิกราคา", "ราคาปรับยางรถยนต์", "บริการซ่อมรถนอกสถานที่", "ร้านยางมิชลินใกล้ฉัน", "ร้านยางไทร์พลัส", "เปลี่ยนยางcockpit", 
                "เปลี่ยนยางมอเตอร์ไซค์นอกสถานที่ใกล้ฉัน", "รับซ่อมรถนอกสถานที่", "ปะยางเคลื่อนที่ใกล้ฉัน", "ร้านปะยางรถบรรทุก24ชมใกล้ฉัน", "เปลี่ยนยางมอเตอร์ไซค์นอกสถานที่", 
                "ร้านซ่อมยางรถยนต์ใกล้ฉัน", "ร้านขายยาง", "ช่างซ่อมรถยนต์นอกสถานที่", "รับเปลี่ยนยางนอกสถานที่ใกล้ฉัน", "ร้านสตรีมยางใกล้ฉัน", "ร้านยางศรีนครินทร์", 
                "ช่างเปลี่ยนยางใกล้ฉัน", "ร้านยางบีควิก", "ร้านเปลี่ยนยางมอเตอร์ไซค์24ชมใกล้ฉัน", "ที่ปะยางรถยนต์", "ร้านยางวงเวียน22ราคา ถูก", "ปะยางมอเตอร์ไซค์นอกสถานที่", 
                "ปะยางสตรีมใกล้ฉัน", "ปะยางมอเตอร์ไซค์นอกสถานที่ใกล้ฉัน", "เปลี่ยนยางขอบ15ราคา", "ร้านปะยางรถยนต์นอกสถานที่ใกล้ฉัน", "ช่างเปลี่ยนยางรถใกล้ฉัน", 
                "ปะยางเคลื่อนที่", "ช่างปะยางรถยนต์ใกล้ฉัน", "เปลี่ยนล้อรถยนต์ราคา", "ร้านขายยางรถยนต์ราคา ถูก", "ร้านยางวงเวียน22เอกไพบูลย์", "ร้านยางcockpit", 
                "ซ่อมยางรถยนต์ใกล้ฉัน", "ร้านยางรถยนต์ราคา ถูกใกล้ฉัน", "ร้านปะยางใกล้ฉันรถยนต์", "ศูนย์เปลี่ยนยางรถยนต์ใกล้ฉัน", "ปะยางราคา", "ปะยาง24ใกล้ฉัน", 
                "ร้านยางapolloใกล้ฉัน", "ร้านปะยางแถวนี้", "ร้านยางdeestoneใกล้ฉัน", "ร้านรับเปลี่ยนยางรถยนต์", "ราคาปรับยางรถยนต์ใกล้ฉัน", "เปลี่ยนยางรถยนต์ราคาถูก", 
                "ซ่อมรถนอกสถานที่", "เปลี่ยนยางรถยนต์ร้านไหนดี", "บริการซ่อมรถยนต์นอกสถานที่", "รับปะยาง24ชม", "ร้านยางรถยนต์ที่ดีที่สุด", "เปลี่ยนยางรถยนต์nexen", 
                "ร้านขายยางรถยนต์ราคา", "เปลี่ยนยางบีควิกราคา", "ปะยาง24ชมราคา", "ร้านยางnexenใกล้ฉัน", "ช่างเปลี่ยนยาง", "บริการเติมลมยางนอกสถานที่", "ร้านยางใกล้บ้าน", 
                "ร้านยางสตาร์บัคส์", "ปะยางบีควิก", "ปะยางรถยนต์นอกสถานที่24ชม", "ราคาปะยางรถยนต์ใกล้ฉัน", "รับปะยางมอเตอร์ไซค์นอกสถานที่", "ร้านยางอ่อนนุช", 
                "ร้านยางสมุทรปราการ", "ซ่อมยางรถยนต์", "บริการเติมลมรถยนต์", "บริการเติมลมยางรถยนต์", "บริการเติมลมยาง24ชม", "บริการซ่อมรถยนต์", 
                "บริการเติมลมยางรถยนต์นอกสถานที่", "บริการซ่อมรถนอกสถานที่24ชม", "บริการเปลี่ยนยางรถยนต์", "บริการเติมลมยางมอเตอร์ไซค์", "บริการเปลี่ยนยางรถ", 
                "บริการเปลี่ยนยางนอกสถานที่24ชม", "ร้านรับซ่อมยาง", "บริการเติมลมมอเตอร์ไซค์", "ร้านขายยางที่ดีที่สุด", "บริการเติมลมยางรถ", "บริการเติมลมยาง24ชม", 
                "บริการเติมลมยางนอกสถานที่", "บริการเติมลมยางรถยนต์24ชม", "บริการเปลี่ยนยาง24ชม", "บริการซ่อมรถนอกสถานที่", "บริการปะยาง24ชม", "บริการเติมลม24ชม", 
                "บริการเติมลมยางรถยนต์24ชม", "ซ่อมยางรถยนต์นอกสถานที่", "บริการซ่อมรถ24ชม", "บริการเติมลมยางรถ24ชม", "บริการซ่อมรถ24ชม", "บริการเปลี่ยนยางรถ24ชม", 
                "บริการเปลี่ยนยาง24ชม", "บริการปะยาง24ชม", "บริการเติมลมยาง24ชม", "บริการเติมลมยางรถ24ชม", "ซ่อมรถ24ชม", "บริการเปลี่ยนยาง24ชม", "บริการปะยาง24ชม", 
                "บริการเติมลม24ชม", "บริการเติมลมยางรถ24ชม", "บริการเติมลมยางรถยนต์24ชม"
                
            ],
            "slide": [
                # "รถสไลด์ใกล้ฉัน","รถสไลด์ด่วน","รถสไลด์ ราคา","รถสไลด์ราคาถูก","รถสไลด์ฉุกเฉิน","เบอร์โทรรถสไลด์"
                # ,"รถสไลด์ถึงที่","รถสไลด์ 24 ชั่วโมง","รถหกล้อสไลด์","รถหกล้อสไลด์ใกล้ฉัน","รถหกล้อสไลด์ด่วน"
                # ,"รถหกล้อสไลด์ ราคา","รถหกล้อสไลด์ราคาถูก","รถหกล้อสไลด์ด่วนนอกสถานที่","รถหกล้อสไลด์ใกล้ๆ"
                # ,"รถหกล้อสไลด์มีประกัน","รถสไลด์มีประกัน","เบอร์โทรรถหกล้อสไลด์","ช่างรถสไลด์มืออาชีพ","รถลากฉุกเฉิน"
                # ,"รถลากด่วน","รถลากใกล้ฉัน","เบอร์โทรรถลาก","รถลากราคาถูก","รถลากมีประกัน","รถลากอุบัติเหตุ"
                # ,"รถลากรถสไลด์","รถยกเล็ก","รถยกเล็กใกล้ฉัน","ราคารถยกเล็ก","รถยกอุบัติเหตุ","รถยกใหญ่","เบอร์โทรรถยกเล็ก"
                # ,"เบอร์โทรรถยกใหญ่","ยกรถบรรทุก","ยกรถกระบะ","ยกรถส่งศูนย์","ยกรถพัง","รถกระบะสไลด์","กระบะสไลด์ใกล้ฉัน"
                # ,"กระบะสไลด์ราคา","กระบะสไลด์เบอร์โทร","กระบะสไลด์ด่วน","กระบะสไลด์ส่งศูนย์","กระบะสไลด์รถอุบัติเหตุ"
                # ,"กระบะสไลด์มีประกัน","กระบะสไลด์มืออาชีพ","กระบะสไลด์ช่างซ่อม","บริการรถฉุกเฉิน","บริการเคลื่อนย้ายรถยนต์"
                # ,"เคลื่อนย้ายรถยนต์ใกล้ฉัน","เคลื่อนย้ายรถยนต์ราคาถูก","เบอร์โทรช่างมืออาชีพ","ซ่อมนอกสถานที่","เบอร์โทรช่างซ่อมนอกสถานที่"
                # ,"รถยกรถสไลด์","บริการถึงที่","บริการ 24 ชั่วโมง","24 Carfix","รถสไลด์ถึงที่ 24 ชั่วโมง","แอดไลน์รถยกรถสไลด์"
                # ,"เรียกรถสไลด์ผ่านแอป","เรียกช่างผ่านแอป","แอปรถสไลด์","แอปซ่อมนอกสถานที่","ศูนย์บริการรถยนต์","รถยก","รถลาก"

                "รถสไลด์","รถยก","รถสไลด์ใกล้ฉัน","รถโฟคลิฟ","โฟร์คลิฟท์","โฟลลิฟ","รถลาก","รถยกรถสไลด์","รถลากใกล้ฉัน","รถสไลด์ราคา",
                "ลิฟท์ยกรถ","ราคารถสไลด์","แฮนด์ลิฟท์ไฟฟ้า","แฮนด์ลิฟท์","โฟล์คลิฟท์ไฟฟ้า","รถโฟล์คลิฟท์ไฟฟ้า","รถแฮนด์ลิฟท์","ลิฟท์ยกของ",
                "รถยกของ","รถอุบัติเหตุ","รถลากจูงใกล้ฉัน","เช่ารถโฟล์คลิฟท์","รถลากจูงราคา","ราคา รถ สไลด์ ข้าม จังหวัด","รถยกไฟฟ้า","รถยกรถสไลด์ใกล้ฉัน",
                "รถลากพาเลท","ราคา รถ โฟล์ค ลิ ฟ ท์ 2.5 ตัน มือ 2","รถสไลด์ใกล้ฉันราคาถูก","แฮนด์ลิฟท์มือสอง","รถสไลด์ราคาถูก","handliftไฟฟ้า",
                "แฮนด์ลิฟท์3ตัน","รถสไลด์รามอินทรา","จ้างรถสไลด์ราคา","ราคา รถ ยก","รถยกพาเลท","ราคา รถ ลาก จูง","บริการรถสไลด์ใกล้ฉัน","รถสไลด์พระราม2",
                "รถลากราคา","แฮนด์ลิฟท์2.5ตัน","รถสไลด์ข้ามจังหวัดราคาถูก","โฟล์คลิฟท์ไฟฟ้าราคา","ลิฟท์ยกรถมือสอง","ราคา รถ โฟล์ค ลิ ฟ ท์ 2.5 ตัน toyota",
                "รถเข็นยกของไฟฟ้า","รถยกลากจูง","แฮนด์ลิฟท์ยกของ","แฮนด์ลิฟท์ไฟฟ้าราคา","รถแฮนด์ลิฟท์ไฟฟ้า","รถเครนยกของ","รถสไลด์ออน","ลิฟท์ยกของไฟฟ้า",
                "ราคา ลิฟท์ ยก รถ","รถยกไฟฟ้าขนาดเล็ก","ลิฟท์ยกรถ4.5ตันราคา","รถสไลด์ข้ามจังหวัด","รถยกรถสไลด์ราคา","ราคา รถ ลาก","รถลากพาเลทไฟฟ้า",
                "โฟล์คลิฟท์มือสอง1ตัน","ลิฟท์ยกรถยนต์ราคา","ลิฟท์ยกรถมอเตอร์ไซค์","รถโฟล์คลิฟท์toyotarราคา","รถโฟล์คลิฟท์ไฟฟ้ายืนขับราคา","รถยกลากพาเลท",
                "รถสไลด์4ล้อราคา","รถยกของไฟฟ้า","รถยกของขนาดเล็ก","ยกรถ","แฮนด์ลิฟท์ยกสูง","รถโฟล์คลิฟท์2.5ตัน","รถforklift","รถสไลด์ราคาเท่าไหร่",
                "รถโฟล์คลิฟท์1.5ตัน","รถยกแฮนด์ลิฟท์","รถยกพาเลทไฟฟ้า","รถยกไฟฟ้าแบบยืนขับ","เครนยกของขนาดเล็ก","รถยกโฟล์คลิฟท์","ราคารถสไลด์4ล้อ",
                "โฟล์คลิฟท์ไฟฟ้าแบบยืน","ลิฟท์ยกรถมือสองราคาถูก","รถยกของหนัก","ลิฟท์ยกมอเตอร์ไซค์","แฮนด์ลิฟท์ไฟฟ้ามือสอง","รถยกสไลด์","ลิฟท์ยกรถยนต์มือสอง",
                "รถเข็นยกของ","ลิฟท์รถยนต์","ล้อรถแฮนด์ลิฟท์","รถโฟล์คลิฟ","รถสแตกเกอร์","รถยกถัง200ลิตร","รถยกตู้คอนเทนเนอร์","รถลิฟท์ยกของ",
                "โฟล์คลิฟท์toyotarรุ่น8ราคา","รถยกรถ","รถโฟล์คลิฟท์ไฟฟ้nichiyu","รถยกลาก","โฟร์คลิฟ","รถสแตกเกอร์ไฟฟ้า","รถลากรถ","รถโฟล์คลิฟท์ไฟฟ้ายืนขับ",
                "สไลด์ออน","รถยกของในโรงงาน","ที่ยกรถยนต์","สไลด์รถ","รถยกของโฟล์คลิฟท์","ขับโฟล์คลิฟท์","กระเช้ายกของ","โฟล์คลิฟท์ยืนขับ","ลิฟท์ยกรถเคลื่อนที่",
                "รถลิฟท์ไฟฟ้า","รถลิฟท์","ลิฟท์กรรไกรมือสอง","ขนาดรถโฟล์คลิฟท์","ลิฟท์ยกรถแบบเตี้ย","โฟล์คลิฟท์แบบยืน","กระเช้ายกคน","ขนาดรถโฟล์คลิฟท์3ตัน","ขับรถโฟคลิฟ",
                "จุดบอดของรถ","ตัวยกรถ","บริษัทนิ่มซี่เส็งรถยกจำกัด","พ่วงลากจูง","มิตรแท้ประกันภัยรถจักรยานยนต์","รถยกถังน้ำมัน200ลิตร","รถยกสูง","รถยกแฮนด์พาเลท",
                "รถลากปทุม","รถสไลด์4ล้อ","รถเข็นถังน้ำมัน200ลิตร","รถโฟคลิฟภาษาอังกฤษ","รถโฟร์คลิฟ","รถโฟร์คลิฟ","รถโฟล์คลิฟท์แบบยืน","ลิฟท์มอเตอร์ไซค์","ลิฟท์ยก",
                "ลิฟท์ยกมอเตอร์ไซค์ไฟฟ้า","ลิฟท์ยกรถญี่ปุ่นมือสอง","ล้อโฟคลิฟ","เครนยก","เครนยกตู้คอนเทนเนอร์","เครนยกรถ","โฟล์คลิฟมือสอง","โฟล์คลิฟราคา",
                "รถหกล้อสไลด์","ราคาสไลด์","รถโฟล์คลิฟท์ให้เช่า","รถโฟล์คลิฟท์ไฟฟ้ามือสอง","รถเครนยกของรับจ้าง","รถสไลด์ข้ามจังหวัดราคา","ลิฟท์ยกรถเงินผ่อน",
                "ราคา รถ ยก รถ สไลด์","ลิฟท์ยกรถ","เบอร์รถลากใกล้ฉัน","แฮนด์ลิฟท์มือสองราคาถูก","ราคา รถ ยก สไลด์","รถสไลด์รถยก","เช่า forklift","โฟล์คลิฟท์ไฟฟ้ามือสอง",
                "โฟล์คลิฟท์ให้เช่า","เรียกรถสไลด์","แฮนด์ลิฟท์1.5ตัน","โฟล์คลิฟท์ไฟฟ้ามือสองราคา","รถสไลด์ออนใกล้ฉัน","รถยกรถลากใกล้ฉัน","ราคา รถ สไลด์ ราคา",
                "เช่ารถโฟล์คลิฟท์ไฟฟ้า","เช่ารถโฟล์คลิฟท์รายวัน","หารถสไลด์","เช่าแฮนด์ลิฟท์","เช่ารถยก","ลิฟท์ยกรถราคาถูก","ราคา จ้าง รถ สไลด์","รถแฮนด์ลิฟท์ราคา",
                "รถโฟล์คลิฟท์ไฟฟ้ toyotaราคา","รถโฟล์คลิฟท์ไฟฟ้าราคา","รถสไลด์รับจ้าง","เจนบรรเจิดรถยก","เช่ารถยกไฟฟ้า","รถสไลด์24ชั่วโมง","รถโฟล์คลิฟท์toyotามือสอง",
                "รถโฟล์คลิฟท์5ตันราคา","โฟล์คลิฟท์1.5ตันราคา","ราคา รถ โฟล์คลิฟท์ไฟฟ้า","รถลากพาเลทมือสอง","แฮนด์ลิฟท์5ตัน","โฟล์คลิฟท์3ตันมือสอง",
                "ราคา รถ โฟล์คลิฟท์ 2.5 ตัน","ราคา จ้าง รถ เฮี๊ยบ","handliftยกสูง","รถสไลด์มอเตอร์ไซค์","รถลากพาเลทไทวัสดุ","รถโฟล์คลิฟท์toyotaมือ1ราคา","รถลากสไลด์",
                "เช่าโฟล์คลิฟท์พร้อมคนขับ","เช่ารถโฟล์คลิฟท์รายเดือน","แฮนด์ลิฟท์2.5ตันมือสอง","รถโฟล์คลิฟท์มือ2ราคา","เช่ารถ forklift","ราคา รถ โฟล์คลิฟท์ 2.5 ตัน มือ 1",
                "ลิฟท์ยกรถ2เสา","ลิฟท์ยกรถคานบน","รถยกไฟฟ้าราคา","เช่ารถโฟล์คลิฟท์อมตะนคร","รถเฮี๊ยบยกของ","เช่ารถยกตู้คอนเทนเนอร์","แฮนด์ลิฟท์2ตัน","โฟล์คลิฟท์ไฟฟ้า1.5ตัน",
                "รถยกสูงไฟฟ้า","โฟคลิฟไฟฟ้า","รถสไลด์พระราม3","รถสไลด์","รถยกไฟฟ้ามือสอง","รถยกพาเลทมือสอง","รถโฟล์คลิฟท์ไฟฟ้า toyota","รถยกเครื่องจักร","สแตกเกอร์ไฟฟ้า",
                "รถลากพาเลทราคาถูก","หารถลาก","ลิฟท์ยกของ","ลิฟท์ยกรถ2เสาราคา","รถยกสินค้า","ลิฟท์ยกรถ2เสา4.5ตัน","รถกระบะสไลด์รับจ้าง","ราคารถแฮนด์ลิฟท์","จ้างรถสไลด์",
                "หารถยก","รถโฟล์คลิฟท์3ตัน","สกลรถยก","โฟล์คลิฟท์ไฟฟ้า2.5ตัน","รถสไลด์มอเตอร์ไซค์ราคา","เรทราคารถสไลด์","แฮนด์ลิฟท์","handstackerราคา","รถสไลด์รับจ้างราคา",
                "เช่ารถฟอร์คลิฟท์","รถยกสไลด์ราคา","รถยกลากราคาถูก","รถยกของขนาดเล็กราคา","ล้อแฮนด์ลิฟท์ราคา","ลิฟท์ยกรถbishamon","แฮนด์ลิฟท์ยกสูงมือสอง","ราคาโฟล์คลิฟท์ไฟฟ้า","โฟล์คลิฟต์ไฟฟ้า",
                "จ้างรถยก","เครนยกของ5ตัน","ลิฟท์ยกรถคานล่าง","รถลิฟท์กระเช้า","รถยกลากไฟฟ้า","แบตเตอรี่รถโฟล์คลิฟท์toyota","เช่ารถสไลด์ราคา","รถforkliftไฟฟ้า","เช่าเครนยกของ","รถโฟล์คลิฟท์komatsumือสอง",
                "ลิฟท์xยกรถ","รถแฮนด์ลิฟท์2.5ตัน","รถเครนยกของราคา","โฟล์คลิฟท์5ตัน","รถยกกระเช้า","รถโฟล์คลิฟท์ไฟฟ้าบีที","รถxลิฟท์","รับจ้างยกรถ","ลิฟท์ยกรถญี่ปุ่น","รถโฟล์คลิฟท์mitsubishiราคา",
                "โฟล์คลิฟท์toyota3ตัน","ราคาขนส่งรถสไลด์","รถแฮนด์ลิฟท์มือสอง","ลิฟท์ยกรถแบบกรรไกร","รถสไลด์ส่งรถ","รถสไลด์อ่อนนุช","ลิฟท์ยกของมือสอง","แฮนด์ลิฟท์1ตัน","ติดต่อรถยก","รถสไลด์พระราม9",
                "ฮอยยกรถ","แบตเตอรี่โฟล์คลิฟท์มือสอง","ลิฟท์กรรไกรยกรถ","แฮนด์ลิฟท์ยกไม่ขึ้น","รถยกรถยนต์","รถลากพาเลทราคา","xlift2ตัน","รถสไลด์ราชพฤกษ์","รถยกไฟฟ้า stacker","โฟล์คลิฟมือ2",
                "รถยกตู้คอนเทนเนอร์ราคา","แฮนด์สแตกเกอร์","รถยกเครน","โฟล์คลิฟท์3ตัน","handlift2.5ตัน","บุบรถยก","รถยกลากพาเลทแบบใช้มือ","เช่าสแต็กเกอร์","รถforkliftมือสอง","รถยกforklift"
            ],
            "key": [
                # "กุญแจรถยนต์หาย", "ทำกุญแจรถยนต์", "ซ่อมกุญแจรีโมท", "ช่างกุญแจใกล้ฉัน", "ปลดล็อคกุญแจบ้าน", "ทำกุญแจใหม่", 
                # "เปลี่ยนแบตเตอรี่รีโมท", "กุญแจรถยนต์ไม่หมุน", "กุญแจรีโมทไม่ทำงาน", "กุญแจบ้านหาย", "กุญแจรถยนต์หัก", "กุญแจรถยนต์ติดขัด", 
                # "รีเซ็ตกุญแจรีโมท", "กุญแจรีโมทไม่ส่งสัญญาณ", "ช่างทำกุญแจด่วน", "ซ่อมกุญแจรีโมทรถยนต์", "กุญแจรีโมทเสื่อม", "กุญแจรีโมทเปิดไม่ได้", 
                # "ทำกุญแจรถยนต์ราคาถูก", "ซ่อมกุญแจรถยนต์ใกล้ฉัน", "กุญแจรถยนต์เปิดไม่ได้", "ช่างกุญแจรถยนต์ด่วน", "กุญแจรีโมทไม่ติด", "กุญแจรถยนต์สตาร์ทไม่ติด", 
                # "ปลดล็อครถยนต์", "ทำกุญแจรีโมท", "บริการทำกุญแจ", "ช่างกุญแจรถยนต์", "กุญแจรถยนต์ล็อค", "กุญแจบ้านหัก", "กุญแจรถยนต์ติดเครื่องไม่ได้", "กุญแจบ้านติดขัด", 
                # "ซ่อมกุญแจรีโมทด่วน", "กุญแจรถยนต์รีโมทไม่ทำงาน", "กุญแจรถยนต์เก่า", "กุญแจรถยนต์ใหม่", "ปัญหากุญแจรถยนต์", "กุญแจบ้านไม่หมุน", "ปลดล็อครถด่วน", "กุญแจรถยนต์สำรอง", 
                # "ทำกุญแจบ้านใหม่", "เปลี่ยนกุญแจรถยนต์", "ปัญหาแบตเตอรี่รีโมท", "ซ่อมกุญแจบ้าน", "กุญแจรถยนต์ลืมไว้ในรถ", "กุญแจรถยนต์สตาร์ทไม่ได้", "กุญแจรีโมทรถยนต์ใหม่", "ซ่อมกุญแจบ้านด่วน", 
                # "กุญแจรีโมทไม่ล็อค", "กุญแจรถยนต์รีเซ็ตไม่ได้", "กุญแจบ้านเสื่อม", "กุญแจรีโมทชำรุด", "กุญแจรีโมทหมด", "บริการซ่อมกุญแจบ้าน", "กุญแจบ้านใหม่", "กุญแจรีโมทเปิดไม่ออก", 
                # "กุญแจรถยนต์ซ่อมได้", "กุญแจรีโมทใช้ไม่ได้", "กุญแจรถยนต์หายทำยังไง", "กุญแจบ้านซ่อม", "กุญแจรถยนต์เปิดไม่ออก", "กุญแจบ้านลืมไว้ในบ้าน", "กุญแจรถยนต์เปิดประตูไม่ได้", 
                # "กุญแจรีโมทเสื่อมสภาพ", "กุญแจบ้านหมุนไม่ได้", "กุญแจรถยนต์รีโมทเปิดประตูไม่ได้", "ปัญหากุญแจรีโมท", "กุญแจรีโมทล็อคไม่ได้", "กุญแจรถยนต์หมุนไม่ออก", "กุญแจบ้านเก่า", 
                # "กุญแจรีโมทช้า", "กุญแจบ้านสำรอง", "ทำกุญแจรถยนต์ด่วน", "กุญแจบ้านรีเซ็ตไม่ได้", "กุญแจรีโมทไม่ตอบสนอง", "กุญแจบ้านใหม่ทำยังไง", "กุญแจรถยนต์ใหม่ทำยังไง", 
                # "กุญแจรีโมทชำรุดทำยังไง", "กุญแจบ้านทำใหม่", "กุญแจรถยนต์ทำใหม่", "กุญแจรีโมทเก่า", "กุญแจรถยนต์รีโมทซ่อมได้", "กุญแจรีโมทหาย", "กุญแจบ้านเก่าซ่อมได้", 
                # "กุญแจรถยนต์หมดแบตเตอรี่", "กุญแจรีโมทชำรุดซ่อมได้", "กุญแจบ้านไม่เปิด", "กุญแจรถยนต์ใช้ไม่ได้", "กุญแจรีโมทใหม่ทำยังไง", "ปัญหากุญแจรถยนต์", "กุญแจรถยนต์ติดล็อค", 
                # "กุญแจรีโมทไฟไม่ขึ้น", "กุญแจรถยนต์ซ่อมไม่ได้", "กุญแจบ้านชำรุด", "กุญแจรีโมทล็อคเปิดไม่ออก", "ช่างกุญแจบ้านใกล้ฉัน", "ซ่อมกุญแจบ้านเก่า", "กุญแจรีโมทไม่ตอบสนอง", 
                # "กุญแจรถยนต์ปลดล็อคไม่ได้", "ทำกุญแจบ้านใหม่ราคา", "ช่างกุญแจรีโมท", "กุญแจรีโมทไม่ติดแบตเตอรี่", "กุญแจรถยนต์รีเซ็ตระบบ", "ซ่อมกุญแจรีโมทรถยนต์ใกล้ฉัน", 
                # "กุญแจบ้านชำรุดซ่อม", "กุญแจรถยนต์แบตหมด", "ช่างซ่อมกุญแจรถยนต์ด่วน", "กุญแจรีโมทมีปัญหา", "กุญแจรถยนต์หมุนไม่ออกสตาร์ทไม่ได้", "กุญแจบ้านหายลืมไว้ในบ้าน", 
                # "ปัญหากุญแจบ้าน", "ช่างกุญแจรีโมทใกล้ฉัน", "ซ่อมกุญแจบ้านติดขัด", "กุญแจรีโมทล็อคไม่ทำงาน", "กุญแจรถยนต์สตาร์ทไม่ติด", "กุญแจรีโมทชาร์จไม่ติด", "กุญแจรถยนต์ใช้ไม่ได้ซ่อมได้", 
                # "กุญแจบ้านรีเซ็ตไม่ได้เปิดไม่ได้", "กุญแจรีโมทไม่ทำงานแก้ไขยังไง", "กุญแจรถยนต์เก่าเปลี่ยนใหม่", "กุญแจรีโมทใช้งานไม่ได้", "ปลดล็อคกุญแจรีโมท", "กุญแจรถยนต์เปิดประตูไม่ได้แก้ยังไง", 
                # "กุญแจรีโมทล็อคไม่ได้เปิดไม่ได้", "กุญแจบ้านชำรุดรีเซ็ต", "กุญแจรีโมทหมดแบตเตอรี่ซ่อม", "กุญแจบ้านติดขัดไม่หมุนได้", "ซ่อมกุญแจบ้านรีโมท", "กุญแจรถยนต์ชำรุดแก้ไข", 
                # "กุญแจรีโมทเปิดประตูไม่ได้ซ่อมได้", "กุญแจรถยนต์หมดประกันทำยังไง", "ช่างกุญแจบ้านเปิดไม่ได้", "กุญแจรีโมทล็อคไม่ตอบสนอง", "กุญแจรถยนต์ใช้ไม่ได้ซ่อมไม่ได้", "กุญแจบ้านเปิดไม่ติด", 
                # "ปลดล็อคกุญแจรีโมทไม่ได้", "กุญแจรถยนต์แบตหมดรีเซ็ต", "กุญแจรีโมทล็อคเสีย", "กุญแจรถยนต์ใช้งานไม่ได้แก้ไขยังไง", "กุญแจรีโมทชาร์จไม่เข้า", "กุญแจรถยนต์เก่าใช้ไม่ได้", 
                # "ซ่อมกุญแจบ้านเปิดไม่ได้", "กุญแจรถยนต์หมุนไม่ติดเปิดไม่ได้", "กุญแจรีโมทล็อคช้า", "กุญแจบ้านรีเซ็ตระบบไม่ได้", "กุญแจรถยนต์เปิดประตูไม่ติด", "กุญแจรีโมทล็อคไม่ตอบสนอง", 
                # "กุญแจบ้านเก่าติดขัด", "กุญแจรีโมทเปิดไม่ติดล็อคไม่ได้", "กุญแจรถยนต์เก่าล็อคไม่ได้", "กุญแจรีโมทเก่าใช้ไม่ได้", "กุญแจบ้านชำรุดแก้ไข", "กุญแจรถยนต์เปิดประตูไม่ได้แก้ยังไง", 
                # "กุญแจรีโมทเปิดไม่ติดซ่อมได้", "กุญแจบ้านเก่าลืมรหัส", "กุญแจรีโมทไม่ทำงานรีเซ็ตไม่ได้", "กุญแจรถยนต์"

                "ร้านทำกุญแจใกล้ฉัน", "กุญแจรถยนต์", "สะเดาะกุญแจ", "กุญแจรีโมท", "ช่างทำกุญแจใกล้ฉัน", "กุญแจรถหาย", "ร้านทำกุญแจรถยนต์ใกล้ฉัน", "ร้านทำกุญแจมอไซค์ใกล้ฉัน", "ทำกุญแจใกล้ฉัน", 
                "รับทำกุญแจใกล้ฉัน", "เปลี่ยนถ่านรีโมทรถยนต์ใกล้ฉัน", "ร้านทำกุญแจ", "ร้านรับทำกุญแจใกล้ฉัน", "ที่ปั๊มกุญแจใกล้ฉัน", "ปั๊มกุญแจรถมอไซค์ใกล้ฉัน", "ร้านเปลี่ยนถ่านรีโมทรถยนต์ใกล้ฉัน", 
                "ร้านทำกุญแจใกล้ฉัน", "ร้านปั๊มลูกกุญแจใกล้ฉัน", "วิธีสะเดาะลูกบิด", "ร้านกุญแจรถใกล้ฉัน", "กุญแจรถยนต์", "ปั๊มกุญแจห้องใกล้ฉัน", "วิธีสะเดาะกุญแจsolo", "กุญแจหาย", 
                "เปิดรถไม่ได้", "ช่างทำกุญแจ", "ช่างสะเดาะกุญแจใกล้ฉัน", "ช่างทำกุญแจรถใกล้ฉัน", "ช่างสะเดาะกุญแจ", "ร้านทำกุญแจรีโมทรถยนต์ใกล้ฉัน", "กุญแจมอไซค์หาย", "ทำกุญแจรถมอเตอร์ไซค์หาย", 
                "กุญแจรถหายไม่มีสำรอง", "ช่างปลดล็อกกุญแจใกล้ฉัน", "ช่างทำกุญแจรถยนต์ใกล้ฉัน", "ช่างเปิดประตูรถ", "ช่างปลดล็อกกุญแจรถใกล้ฉัน", "ช่างทำกุญแจบ้านใกล้ฉัน", "ทำกุญแจรถมอเตอร์ไซค์ใกล้ฉัน", 
                "กุญแจรีโมทรถยนต์", "ร้านทำรีโมทรถยนต์ใกล้ฉัน", "กุญแจรีโมทรถยนต์หาย", "รับทำกุญแจรถใกล้ฉัน", "ร้านทำกุญแจบ้านใกล้ฉัน", "ร้านซ่อมรีโมทรถยนต์ใกล้ฉัน", "กุญแจรีโมทtoyota", "ช่างทำกุญแจใกล้ฉัน", 
                "ช่างทำกุญแจรถ", "ร้านรับทำกุญแจรถใกล้ฉัน", "ร้านทำกุญแจรถยนต์", "ทำกุญแจรถหาย", "ร้านกุญแจรีโมทรถยนต์ใกล้ฉัน", "ช่างทำกุญแจมอเตอร์ไซค์ใกล้ฉัน", "ร้านทำกุญแจ", "ช่างซ่อมกุญแจใกล้ฉัน", 
                "ช่างสะเดาะกุญแจใกล้ฉันราคา", "รถล็อคเอง", "กุญแจรถหายทำใหม่เท่าไหร่", "กุญแจรีโมทisuzuแท้ศูนย์ราคา", "รับทำกุญแจรีโมทรถยนต์ราคาถูก", "วิธีสะเดาะกุญแจ", "กุญแจรถหายtoyota", "กุญแจรีโมทหาย", 
                "ที่ทำกุญแจใกล้ฉัน", "กุญแจรีโมทมิตซูบิชิไทรทันราคา", "ราคารีโมทรถยนต์", "ช่างทำกุญแจ", "ทำกุญแจรีโมท", "ทำกุญแจรถยนต์", "ช่างซ่อมกุญแจรถยนต์ใกล้ฉัน", "กุญแจบ้านหายไม่มีสำรอง", "กุญแจรีโมทhondacityราคาศูนย์", 
                "ปั๊มกุญแจรถยนต์ราคา", "ร้านปั๊มกุญแจใกล้ฉัน", "กัดดอกกุญแจรถยนต์ราคา", "ร้านปั๊มกุญแจรถใกล้ฉัน", "รับทำกุญแจรถยนต์ใกล้ฉัน", "ร้านรับปั๊มกุญแจใกล้ฉัน", "ปั๊มกุญแจรถยนต์toyotาราคา", "กุญแจรีโมทhondacity", 
                "กุญแจรีโมทisuzudmaxเก่า", "กุญแจรีโมทscoopyi", "กุญแจรีโมทtoyotaaltisราคา", "กุญแจรีโมทtoyotavigoราคา", "กุญแจรีโมทtoyotayarisativ", "กุญแจรีโมทประตูบ้าน", "กุญแจรีโมทมอเตอร์ไซค์", "กุญแจรีโมทรถยนต์isuzu", 
                "กุญแจสมาร์ทคีย์honda", "กุญแจสตาร์ทรถ", "กุญแจสำรองpcx", "กุญแจฮอนด้าซิตี้", "กุญแจไฟฟ้า", "คู่มือเซ็นทรัลล็อค", "งัดกุญแจ", "จูนรีโมทรถยนต์", "ช่างกุญแจพระราม4", "ช่างกุญแจหน่อง", "ช่างสะเดาะลูกบิด", 
                "ทำกุญแจใกล้ฉัน", "ที่ปั๊มกุญแจใกล้ฉัน", "ที่ล็อคมอเตอร์ไซค์", "ที่ล็อครถ", "ที่ล็อครถมอเตอร์ไซค์", "รถล็อคเองhonda", "รถล็อคเองisuzu", "รถล็อคเองเปิดไม่ได้", "รถล็อคไม่ได้toyota", "รับปั๊มกุญแจ", "รีโมทpcx", 
                "รีโมทมอไซค์", "รีโมทรถมอเตอร์ไซค์honda", "รีโมทรถมอเตอร์ไซค์scoopyi", "รีโมทรถยนต์honda", "รีโมทรถยนต์isuzu", "รีโมทรถยนต์แบตหมด", "รีโมทรถยนต์ใกล้ฉัน", "รีโมทสตาร์ทรถ", "รีโมทสตาร์ทรถมอเตอร์ไซค์", 
                "ร้านทำกุญแจที่ใกล้ที่สุด", "ร้านทำกุญแจมาสเตอร์คีย์", "ร้านทำกุญแจรถยนต์ใกล้ฉัน", "ร้านทำกุญแจรีโมทกรอบรีโมทช่างกล้า", "ร้านปั๊มกุญแจkeycopyshop", "ร้านปั๊มกุญแจรถ", "ร้านปั๊มลูกกุญแจ", "ร้านเปลี่ยนถ่านรีโมทใกล้ฉัน", 
                "ลูกกุญแจหาย", "ล็อครถ", "ล็อครถมอเตอร์ไซค์", "วิธีการสะเดาะกุญแจ", "วิธีงัดกุญแจ", "วิธีปลดล็อกกุญแจลูกบิด", "วิธีสะเดาะกลอน", "วิธีสะเดาะลูกบิดง่ายๆ", "วิธีสะเดาะลูกบิดด้วยกิ๊บ", "วิธีสะเดาะแม่กุญแจ", "สตาร์ทรถทิ้งไว้รถล็อคเอง", 
                "สตาร์ทรถยนต์ด้วยรีโมท", "สะเดาะกลอน", "สะเดาะลูกบิด", "สะเดาะแม่กุญแจ", "เปลี่ยนถ่านรีโมทใกล้ฉัน", "เปิดกุญแจรถทิ้งไว้สตาร์ทไม่ติด", "เปิดกุญแจรถมอไซค์ทิ้งไว้", "เสียบกุญแจรถทิ้งไว้สตาร์ทไม่ติด", "แบตกุญแจรถ", 
                "แบตรีโมทรถหมด", "รถล็อค", "ช่างสะเดาะกุญแจบ้านใกล้ฉัน", "ช่างซ่อมกุญแจประตู", "ช่างสะเดาะกุญแจรถใกล้ฉัน", "ทำกุญแจรีโมทรถยนต์ใกล้ฉัน", "กุญแจตู้เซฟหายราคา", "รับทำกุญแจรีโมทรถยนต์ราคา", "ช่างกุญแจรีโมทรถยนต์", 
                "ช่างสะเดาะกุญแจรถยนต์", "ช่างทำกุญแจบ้าน", "ช่างทำกุญแจรถหาย", "ช่างทำกุญแจรถยนต์", "ช่างทำกุญแจมอเตอร์ไซค์", "ช่างเปิดกุญแจรถ", "ปั๊มกุญแจรถยนต์", "ราคากุญแจรถมอเตอร์ไซค์", "รีโมทสตาร์ทรถยนต์", "บริการทำกุญแจ", 
                "บริการรับทำกุญแจ", "บริการทำกุญแจใกล้ฉัน", "บริการเปลี่ยนถ่านรีโมท", "บริการสะเดาะกุญแจ", "บริการกุญแจหาย", "บริการเปิดกุญแจรถ", "บริการเปิดกุญแจ", "เปลี่ยนลูกกุญแจ", "เพราะเหตุใดต้องทำกุญแจ", "ประโยชน์ของการทำกุญแจ", 
                "สำรองกุญแจ", "สมาร์ทคีย์", "ระบบกุญแจ", "บริการกุญแจ", "ระบบล็อค", "ระบบล็อคกุญแจ", "ปั๊มกุญแจ", "ประตูล็อค", "ช่องล็อค", "ประตูล็อคเอง", "บริการสะเดาะกุญแจ", "รับซ่อมกุญแจ", "เปิดรถ", "เปิดบ้าน", "ซ่อมลูกกุญแจ", 
                "ทำกุญแจหาย", "การทำกุญแจ", "การสะเดาะกุญแจ", "การบริการกุญแจ", "การทำกุญแจ", "การทำกุญแจให้ได้มาตรฐาน", "การทำกุญแจปลอดภัย", "การบริการทำกุญแจ", "การทำกุญแจรถ", "การทำกุญแจบ้าน", "การทำกุญแจสำรอง", 
                "การทำกุญแจรีโมท", "การซ่อมกุญแจ", "การซ่อมลูกกุญแจ", "การเปลี่ยนกุญแจ", "การปลดล็อค", "การสะเดาะกุญแจ", "การสร้างกุญแจ", "การปั๊มกุญแจ", "การเปิดกุญแจ", "การบริการเปิดกุญแจ", "การบริการสะเดาะกุญแจ", "การบริการทำกุญแจ", 
                "การทำกุญแจที่ได้มาตรฐาน", "การทำกุญแจที่ปลอดภัย", "การทำกุญแจรีโมทที่ได้มาตรฐาน", "การทำกุญแจบ้าน", "การทำกุญแจรถยนต์", "การบริการกุญแจบ้าน", "การบริการกุญแจรถยนต์", "การบริการเปิดกุญแจบ้าน", "การบริการเปิดกุญแจรถ", 
                "การบริการทำกุญแจใกล้ฉัน", "การบริการสะเดาะกุญแจใกล้ฉัน", "การบริการเปิดกุญแจใกล้ฉัน", "การบริการทำกุญแจรถยนต์ใกล้ฉัน", "การบริการทำกุญแจบ้านใกล้ฉัน", "การบริการเปิดกุญแจบ้านใกล้ฉัน"
            ],
            "battery": [
                # "เปลี่ยนแบตเตอรี่รถยนต์","แบตเตอรี่รถยนต์หมด","ชาร์จแบตเตอรี่รถยนต์","บริการเปลี่ยนแบตเตอรี่ถึงที่","แบตเตอรี่รถยนต์ใกล้ฉัน",
                # "ซ่อมแบตเตอรี่รถยนต์","ตรวจเช็คแบตเตอรี่รถยนต์","แบตเตอรี่รถยนต์ราคาถูก","แบตรถราคาถูก","แบตเตอรี่รถยนต์ยี่ห้อไหนดี",
                # "เปลี่ยนแบตเตอรี่รถยนต์ด่วน","เปลี่ยนแบตด่วน","แบตเตอรี่รถยนต์ไฟไม่เข้า","รถยนต์ไฟไม่เข้า","แบตเตอรี่รถยนต์ใช้นานแค่ไหน",
                # "เลือกแบตยี่ห้อไหนดี","ร้านแบตเตอรี่รถยนต์ใกล้ฉัน","แบตเสื่อม","แบต 24 ชั่วโมง","ตรวจสภาพแบตเตอรี่","อาการแบตเสื่อม",
                # "แบตเตอรี่ไม่เก็บไฟ","แบตเตอรี่มีปัญหา","ร้านขายแบตเตอรี่รถยนต์","แบตเตอรี่รถยนต์ยี่ห้อไหนทน","แบตยี่ห้อไหนทน","",
                # "เปลี่ยนแบตเตอรี่รถยนต์ที่ไหนดี","ซ่อมแบตเตอรี่รถยนต์ถึงบ้าน","การบำรุงรักษาแบตเตอรี่รถยนต์","วิธีดูแลแบตเตอรี่รถยนต์",
                # "การเลือกซื้อแบตเตอรี่รถยนต์","แบตหมด","เปลี่ยนแบตสำรองรถยนต์","ช่างแบตใกล้ฉัน","อายุแบตเตอรี่รถยนต์","ร้านแบตเตอรี่รถยนต์ใกล้ฉัน",
                # "ร้านชาร์จแบตเตอรี่รถยนต์ใกล้ฉัน","แบตเตอรี่รถยนต์ใกล้ฉัน","เปลี่ยนแบตเตอรี่รถยนต์ใกล้ฉัน","เปลี่ยนแบตรถยนต์","แบตเตอรี่นอกสถานที่",
                # "ร้านแบตเตอรี่รถยนต์ใกล้ฉัน","พ่วงแบตรถเก๋ง","เปลี่ยนแบต","ไฟชาร์จไม่เข้า","ไดสตาร์ทเสีย","ไดชาร์จเสีย","ไฟไม่เข้า","เปลี่ยนไดชาร์จ",
                # "เปลี่ยน battery","battery ใกล้ฉัน","เปลี่ยน battery","battery นอกสถานที่","จั๊มแบต","จั๊มแบตนอกสถานที่","จั๊มแบตเตอรี่ใกล้ฉัน",
                # "พ่วงแบตนอกสถานที่","พ่วงแบตกใกล้ฉัน","battery ราคา",
                "แบตเตอรี่รถยนต์", "รถสตาร์ทไม่ติด", "ร้านแบตใกล้ฉัน", "ราคาแบตเตอรี่รถยนต์", "แบตเตอรี่รถยนต์ราคา", "แบตรถยนต์ราคา", "รถสตาร์ทไม่ติด", 
                "รถสตาร์ทไม่ค่อยติด", "ราคาแบตเตอรี่รถยนต์", "ไดสตาร์ทเสีย", "จั๊มแบต", "เปลี่ยนแบต", "พ่วงแบต", "ไฟแบตโชว์", "แบตเตอรี่รถยนต์ใกล้ฉัน", 
                "เปลี่ยนแบตเตอรี่รถยนต์ใกล้ฉัน", "เปลี่ยนแบตรถ", "ร้านแบตรถยนต์ใกล้ฉัน", "จั๊มแบตรถยนต์", "รถแบตหมด", "จั๊มแบตรถยนต์ใกล้ฉัน", "ราคาแบตเตอรี่รถยนต์กระบะ", 
                "เปลี่ยนแบตเตอรี่ใกล้ฉัน", "ที่ชาร์จแบตรถยนต์", "ร้านชาร์จแบตเตอรี่รถยนต์ใกล้ฉัน", "ราคาแบตเตอรี่รถเก๋ง", "พ่วงแบตรถยนต์", "แบตรถยนต์หมด", "แบตรถยนต์ใกล้ฉัน", "จั๊มแบตรถใกล้ฉัน", 
                "แบตamaron", "วิธีพ่วงแบตรถยนต์", "จั๊มสตาร์ทรถยนต์", "แบตเตอรี่รถยนต์แบบแห้งราคา", "สตาร์ทรถไม่ติด", "แบตเตอรี่รถยนต์amaron", "เปลี่ยนแบตรถยนต์", "แบตเตอรี่รถยนต์gs", "แบตเตอรี่รถเก๋ง", 
                "แบตรถเก๋งราคา", "แบตเตอรี่รถยนต์มือสอง", "รถยนต์สตาร์ทไม่ติดแต่มีไฟ", "แบตเตอรี่รถกระบะ", "รถสตาร์ทไม่ติดไฟหน้าปัดขึ้น", "ที่ชาร์จแบตเตอรี่รถยนต์", "รถสตาร์ทไม่ติดแบตไม่หมด", "ชาร์จแบตเตอรี่รถยนต์", 
                "รถสตาร์ทไม่ติดมีเสียงแก๊กๆ", "แบตเตอรี่รถมอเตอร์ไซค์ราคา", "แบตเตอรี่100แอมป์", "วิธีจั๊มแบตรถยนต์", "ร้านขายแบตใกล้ฉัน", "รถสตาร์ตติดยาก", "แบตรถยนต์มือสองราคา", "มอเตอร์สตาร์ทไม่ติด", 
                "ร้านเปลี่ยนแบตรถใกล้ฉัน", "อาการไดสตาร์ทเสีย", "แบตรถamaron", "นอกสถานที่", "เปลี่ยนแบตนอกสถานที่", "เปลี่ยนแบตรถยนต์นอกสถานที่ใกล้ฉัน", "แบตเตอรี่24ชั่วโมง", "ร้านเปลี่ยนแบตรถยนต์ใกล้ฉัน", 
                "เปลี่ยนแบต24ชั่วโมง", "เปลี่ยนแบต24ชั่วโมงใกล้ฉัน", "ราคาแบตเตอรี่รถยนต์gs", "แบตเตอรี่24ชั่วโมงใกล้ฉัน", "เปลี่ยนแบตนอกสถานที่ใกล้ฉัน", "batteryรถยนต์", "แบตเตอรี่รถยนต์ราคาถูก", "แบตเตอรี่รถยนต์24ชั่วโมง", 
                "ราคาแบตรถยนต์", "ร้านจั๊มแบตรถยนต์ใกล้ฉัน", "บริการจั๊มแบตใกล้ฉัน", "ขายแบตเตอรี่รถยนต์", "บริการจั๊มแบต", "ร้านพ่วงแบตเตอรี่ใกล้ฉัน", "มิตรภาพแบตเตอรี่", "เปลี่ยนแบตรถนอกสถานที่", "พ่วงแบตรถยนต์ใกล้ฉัน", 
                "ราคาแบตเตอรี่รถยนต์fb", "เปลี่ยนแบตรถ24ชั่วโมง", "แบตเตอรี่fordranger2.2ราคา", "แบตเตอรี่รถยนต์panasonic", "ร้านเปลี่ยนแบตใกล้ฉัน", "เช็คราคาแบตเตอรี่รถยนต์", "แบตเตอรี่nockสถานที่", "ร้านแบตเตอรี่amaronใกล้ฉัน", 
                "แบตเตอรี่รถยนต์ราคาเท่าไหร่", "พ่วงแบตเตอรี่", "gsแบตเตอรี่ราคา", "ราคาแบตเตอรี่รถยนต์แบบแห้ง", "ร้านรับชาร์จแบตรถยนต์ใกล้ฉัน", "แบตเตอรี่gs80แอมป์ราคา", "แบตเตอรี่ไฮบริดtoyotacamryราคา", "fbแบตเตอรี่ราคา", 
                "แบตเตอรี่amaronราคา", "โชคบัญชาแบตเตอรี่", "ร้านจั๊มแบตใกล้ฉัน", "gsbatteryราคา", "จั๊มแบตใกล้ฉัน", "แบตเตอรี่gs90แอมป์ราคา", "ร้านชาร์จแบตรถยนต์ใกล้ฉัน", "ร้านขายแบตรถยนต์ใกล้ฉัน", "รถแบตหมดไม่มีสายพ่วง", 
                "จั๊มแบตใกล้ฉัน", "แบตเตอรี่3k75แอมป์ราคา", "ร้านแบตใกล้ๆฉัน", "แบตเตอรี่รถยนต์3kราคา", "ราคาแบตรถเก๋ง", "ราคาแบตเตอรี่รถยนต์โตโยต้า", "เปลี่ยนแบตมอเตอร์ไซค์ใกล้ฉัน", "แบตเตอรี่รถยนต์ราคags", "แบตเตอรี่amaron90แอมป์ราคา", 
                "ราคาแบตเตอรี่gs", "ร้านแบตรถใกล้ฉัน", "ร้านเปลี่ยนแบตมอเตอร์ไซค์ใกล้ฉัน", "ราคาแบตเตอรี่รถยนต์3k", "แบตเตอรี่100แอมป์ราคา", "แบตเตอรี่gs45แอมป์ราคา", "แบตเตอรี่รถกระบะisuzuราคา", "บริการพ่วงแบตฟรี", "แบตเตอรี่ไฮบริดโตโยต้าราคา", 
                "แบตเตอรี่fbราคา", "แบตเตอรี่3k100แอมป์ราคา", "แบตเตอรี่amaron100แอมป์ราคา", "แบตเตอรี่gs100แอมป์ราคา", "เปลี่ยนแบตมอเตอร์ไซค์นอกสถานที่", "แบตเตอรี่fordranger", "แบตเตอรี่3k50แอมป์ราคา", 
                "ขายแบตเตอรี่รถยนต์ใกล้ฉัน", "แบตเตอรี่boliden", "แบตเตอรี่รถยนต์80แอมป์ราคา", "แบตเตอรี่fb75แอมป์ราคา", "เปลี่ยนแบตมาสด้า2", "แบตเตอรี่รถยนต์amaronราคา", "แบตเตอรี่ไฮบริดtoyotarราคาเท่าไหร่", 
                "พ่วงแบตเตอรี่รถยนต์", "ร้านแบตเตอรี่รถยนต์ใกล้ๆฉัน", "แบตเตอรี่fb100แอมป์ราคา", "แบตgs", "ราคาแบตเตอรี่รถกระบะ4ประตู", "แบตเตอรี่revo2.4ราคา", "รถแบตหมดสตาร์ทไม่ติด", "bquikเปลี่ยนแบต", "บริการจั๊มแบตราคา", 
                "แบตเตอรี่รถยนต์gsราคา", "แบตเตอรี่รถยนต์fb", "แบตเตอรี่รถยนต์ราคาโรงงาน", "แบตเตอรี่gs70แอมป์ราคา", "แบตเตอรี่mghsราคา", "ร้านหม้อแบตใกล้ฉัน", "แบตamaronใกล้ฉัน", "แบตเตอรี่65แอมป์ราคา", "ราคาแบตเตอรี่fb", 
                "แบตเตอรี่รถยนต์มือสองราคาถูก", "แบตเตอรี่รถยนต์มาสด้า2", "แบตเตอรี่รถยนต์100แอมป์ราคา", "แบตgsราคา", "แบตเตอรี่amaron80แอมป์ราคา", "ชาร์จแบตรถยนต์ราคา", "แบตเตอรี่รถยนต์ฟอร์ดเรนเจอร์", "แบตเตอรี่boliden110แอมป์ราคา", 
                "แบตเตอรี่gs50แอมป์ราคา", "สายจั๊มแบตรถยนต์", "รถเสียสตาร์ทไม่ติด", "แบตเตอรี่fb65แอมป์ราคา", "ราคาแบตเตอรี่amaron", "แบตเตอรี่รถยนต์45แอมป์ราคา", "แบตเตอรี่รถกระบะราคา", "เปลี่ยนแบตบีควิก", "ราคาแบตเตอรี่รถยนต์ราคาถูก", 
                "แบตเตอรี่รถยนต์มือสองใกล้ฉัน", "ชาร์จแบตรถยนต์ใกล้ฉัน", "ราคาแบตรถกระบะ", "สายพ่วงแบตรถยนต์", "เปลี่ยนแบตรถมอเตอร์ไซค์ใกล้ฉัน", "เปลี่ยนแบตรถราคา", "แบตเตอรี่amaron45แอมป์ราคา", "แบตเตอรี่นิสสันอัลเมร่า", "แบตเตอรี่รถเบนซ์", 
                "แบตแห้งรถยนต์", "แบตเตอรี่รถยนต์2.4", "ชาร์จแบตเตอรี่รถยนต์", "แบตเตอรี่รถกระบะfordราคา", "แบตเตอรี่รถยนต์ราคาไม่เกิน2000", "แบตเตอรี่รถยนต์panasonicราคา", "แบตเตอรี่fordราคา", "แบตเตอรี่รถยนต์mazdaราคา", 
                "บริการแบตเตอรี่รถยนต์นอกสถานที่", "แบตเตอรี่mgbราคา", "แบตเตอรี่จ่ายแล้ว", "แบตเตอรี่รถกระบะราคาเท่าไหร่", "แบตเตอรี่รถยนต์isuzu", "แบตเตอรี่4wdsuvราคา", "แบตเตอรี่รถยนต์honda", "เปลี่ยนแบตเตอรี่รถยนต์ราคา", "อาการสตาร์ทรถไม่ติด", 
                "แบตเตอรี่รถฟอร์ด", "แบตเตอรี่รถยนต์อัลติส", "แบตเตอรี่รถยนต์fordราคา", "แบตเตอรี่รถยนต์ปาเจโร่", "ราคาแบตเตอรี่รถยนต์honda", "เปลี่ยนแบตเตอรี่รถยนต์honda", "แบตเตอรี่รถยนต์nissanราคา", "ราคาแบตเตอรี่รถยนต์แถมฟรี", 
                "แบตเตอรี่รถยนต์1.5", "ราคาแบตเตอรี่รถยนต์มาสด้า", "แบตเตอรี่รถยนต์อีซูซุ", "ราคาแบตเตอรี่รถยนต์isuzu", "ราคาแบตเตอรี่รถยนต์แบบน้ำ", "ราคาแบตเตอรี่รถยนต์ทุกรุ่น", "ราคาแบตเตอรี่รถยนต์รุ่นเก่า", "แบตเตอรี่รถยนต์อีซูซุราคา", 
                "แบตเตอรี่รถเก๋งนอกสถานที่", "แบตเตอรี่รถยนต์4ประตู", "ราคาแบตเตอรี่รถยนต์ต่างๆ", "เปลี่ยนแบตเตอรี่รถยนต์ตามบ้าน", "ราคาแบตเตอรี่รถยนต์เพื่อน", "แบตเตอรี่รถยนต์55แอมป์ราคา", "แบตเตอรี่รถกระบะhilux", "ราคาแบตเตอรี่รถยนต์ทุกยี่ห้อ", 
                "ราคาแบตเตอรี่รถยนต์4ประตู", "ราคาแบตเตอรี่รถกระบะห้าประตู", "แบตเตอรี่รถกระบะราคาไม่เกิน2000", "แบตเตอรี่รถอีซูซุ", "ราคาแบตเตอรี่รถยนต์4000", "ราคาแบตเตอรี่รถยนต์โตโยต้า", "ราคาแบตเตอรี่รถอีซูซุ", "แบตเตอรี่300แอมป์", 
                "ราคาแบตเตอรี่รถยนต์มิตซูบิชิ", "แบตเตอรี่รถยนต์20แอมป์", "ราคาแบตเตอรี่รถยนต์ประเภทต่างๆ", "แบตเตอรี่กระบะราคา", "แบตเตอรี่รถยนต์hondaราคา", "แบตเตอรี่รถยนต์1.2", "ราคาแบตเตอรี่รถยนต์5", "ราคาแบตเตอรี่รถยนต์40แอมป์", 
                "แบตเตอรี่รถยนต์dmax", "แบตเตอรี่รถยนต์มือสองราคาถูก", "ราคาแบตเตอรี่รถยนต์vigo", "ราคาแบตเตอรี่รถยนต์ใหม่", "ราคาแบตเตอรี่รถกระบะรุ่นเก่า", "เปลี่ยนแบตเตอรี่รถกระบะ", "ราคาแบตเตอรี่รถยนต์ดีเซล", "ราคาแบตเตอรี่รถกระบะราคา", 
                "แบตเตอรี่รถยนต์vigo", "แบตเตอรี่รถยนต์ราคาไม่เกิน1500", "แบตเตอรี่รถยนต์5", "ราคาแบตเตอรี่รถยนต์50แอมป์", "ราคาแบตเตอรี่รถยนต์suzuki", "แบตเตอรี่รถยนต์รุ่นเก่า", "แบตเตอรี่รถยนต์250แอมป์", "ราคาแบตเตอรี่รถยนต์เก่า", 
                "ราคาแบตเตอรี่รถยนต์อีซูซุ", "ราคาแบตเตอรี่รถยนต์toyota", "ราคาแบตเตอรี่รถกระบะรุ่นใหม่", "ราคาแบตเตอรี่รถยนต์isuzuราคา", "ราคาแบตเตอรี่รถยนต์honda", "ราคาแบตเตอรี่รถกระบะราคาไม่เกิน2000", "แบตเตอรี่รถยนต์ใหม่", "แบตเตอรี่ซุปเปอร์",
                  "ราคาแบตเตอรี่รถยนต์ใกล้บ้าน", "ราคาแบตเตอรี่รถยนต์อีซูซุ", "ราคาแบตเตอรี่รถยนต์รุ่นใหม่", "ราคาแบตเตอรี่รถกระบะisuzu", "ราคาแบตเตอรี่รถกระบะราคา", "แบตเตอรี่ราคารถยนต์", "ราคาแบตเตอรี่รถยนต์ดีเซล", "ราคาแบตเตอรี่รถยนต์3k", 
                  "แบตเตอรี่รถยนต์อีซูซุราคา", "ราคาแบตเตอรี่รถยนต์dmax", "ราคาแบตเตอรี่รถยนต์5", "ราคาแบตเตอรี่รถยนต์honda", "ราคาแบตเตอรี่รถยนต์ราคา", "ราคาแบตเตอรี่รถยนต์suzuki", "ราคาแบตเตอรี่รถยนต์ติดตั้ง", "ราคาแบตเตอรี่รถยนต์2700", 
                  "ราคาแบตเตอรี่รถยนต์honda", "ราคาแบตเตอรี่รถยนต์5", "ราคาแบตเตอรี่รถยนต์ติดตั้ง", "ราคาแบตเตอรี่รถยนต์ราคาถูก", "ราคาแบตเตอรี่รถยนต์มีประกัน", "ราคาแบตเตอรี่รถยนต์g", "ราคาแบตเตอรี่รถยนต์มีประกัน", "ราคาแบตเตอรี่รถยนต์2500", 
                  "ราคาแบตเตอรี่รถยนต์50แอมป์", "ราคาแบตเตอรี่รถยนต์1000", "ราคาแบตเตอรี่รถยนต์แบบขา", "ราคาแบตเตอรี่รถยนต์2500", "ราคาแบตเตอรี่รถยนต์80แอมป์", "ราคาแบตเตอรี่รถยนต์ราคา", "ราคาแบตเตอรี่รถยนต์1000", "ราคาแบตเตอรี่รถยนต์40แอมป์", 
                  "ราคาแบตเตอรี่รถยนต์1000", "ราคาแบตเตอรี่รถยนต์ประเภทต่างๆ", "ราคาแบตเตอรี่รถยนต์1100", "ราคาแบตเตอรี่รถยนต์1500", "ราคาแบตเตอรี่รถยนต์g", "ราคาแบตเตอรี่รถยนต์100", "ราคาแบตเตอรี่รถยนต์4000", "ราคาแบตเตอรี่รถยนต์500", 
                  "ราคาแบตเตอรี่รถยนต์1000", "ราคาแบตเตอรี่รถยนต์ราคา", "ราคาแบตเตอรี่รถยนต์500", "ราคาแบตเตอรี่รถยนต์suzuki", "ราคาแบตเตอรี่รถยนต์นอกสถานที่", "ราคาแบตเตอรี่รถยนต์โรงงาน"
            ],
            "air": [
                # "แอร์รถยนต์", "แอร์ไม่เย็น", "ล้างแอร์รถยนต์", "ซ่อมแอร์รถยนต์", "เติมน้ำยาแอร์", "แอร์มีกลิ่น", "แอร์มีเสียง", "แอร์รั่ว", "แอร์รถไม่ทำงาน", "แอร์เย็นช้า", "แอร์ไม่เย็นขณะจอด", 
                # "แอร์เย็นไม่ทั่ว", "แอร์ตัดบ่อย", "แอร์มีกลิ่นเหม็น", "แอร์ไม่ทำงานตอนขับ", "น้ำแอร์หยด", "แอร์เย็นไม่เท่ากัน", "แอร์ไม่เย็นข้างเดียว", "แอร์เสีย", "ซ่อมแอร์ด่วน", "ล้างตู้แอร์", 
                # "แอร์ไม่เย็นลมเบา", "แอร์เย็นแค่หน้า", "แอร์มีควัน", "ซ่อมแอร์ไม่เย็น", "น้ำยาแอร์หมด", "ระบบแอร์เสีย", "เปลี่ยนกรองแอร์", "ซ่อมแอร์ระบบรั่ว", "แอร์เสียงดัง", "แอร์รั่วน้ำ", 
                # "แอร์ร้อน", "แอร์เย็นน้อย", "แอร์ไม่เย็นขณะวิ่ง", "แอร์มีน้ำแข็งเกาะ", "แอร์สั่น", "แอร์มอเตอร์พัง", "แอร์เย็นช้าเวลาเปิด", "น้ำยาแอร์รั่ว", "แอร์ไม่เย็นตอนจอด", "แอร์ไม่เย็นลมไม่แรง", 
                # "แอร์ทำงานผิดปกติ", "ระบบแอร์ไม่ทำงาน", "แอร์ไม่ตัด", "ล้างกรองแอร์", "ซ่อมพัดลมแอร์", "แอร์ไม่ทำงานตอนขับช้า", "แอร์ทำงานบ้างไม่ทำบ้าง", "แอร์ไม่เย็นเฉพาะหน้ารถ", "ซ่อมท่อแอร์รั่ว", 
                # "แอร์ไม่เย็นลมออกเบา", "เปลี่ยนตู้แอร์", "เติมน้ำยาแอร์ด่วน", "แอร์ทำงานผิดปกติ", "ซ่อมท่อแอร์", "ระบบแอร์พัง", "แอร์ทำงานแต่ไม่เย็น", "ซ่อมระบบแอร์ด่วน", "แอร์เย็นไม่พอ", 
                # "แอร์ไม่เย็นหลังรถ", "แอร์ทำงานแต่ลมไม่ออก", "ระบบแอร์มีน้ำรั่ว", "ระบบแอร์รถยนต์", "ระบบแอร์ไม่ทำงานตอนร้อน", "แอร์รถยนต์ไม่เย็น", "แอร์เย็นเฉพาะหน้ารถ", "แอร์มีน้ำรั่ว", 
                # "แอร์รั่วจากใต้ท่อ", "ซ่อมแอร์ไม่ทำงาน", "แอร์ทำงานแต่ไม่ตัด", "ระบบแอร์มีปัญหา", "ระบบแอร์ไม่เย็น", "ระบบแอร์ติดขัด", "แอร์เย็นไม่ทั่วรถ", "แอร์ทำงานตลอดเวลา", "ล้างตู้แอร์รถยนต์", 
                # "ซ่อมระบบแอร์รถยนต์", "แอร์ไม่เย็นตอนรถจอด", "ระบบแอร์อุดตัน", "เปลี่ยนระบบแอร์", "แอร์ไม่ตัดต่อ", "ระบบแอร์ไม่ตัด", "แอร์ไม่เย็นลมออกน้อย", "แอร์ทำงานไม่เต็มที่", "แอร์ทำงานแต่ไม่ค่อยเย็น", 
                # "ระบบแอร์เสียงดัง", "เปลี่ยนระบบแอร์ด่วน", "แอร์มีน้ำแข็งในระบบ", "ล้างระบบแอร์", "แอร์รั่วน้ำใต้ท่อ", "แอร์ทำงานสลับเย็น", "ระบบแอร์มีปัญหาน้ำหยด", "แอร์ไม่ทำงานบ้างทำบ้าง", 
                # "แอร์ไม่เย็นในช่วงรถติด", "ระบบแอร์ทำงานไม่เต็มที่", "ซ่อมแอร์ลมไม่แรง", "ระบบแอร์เย็นน้อย", "แอร์ไม่เย็นลมออกนิดเดียว","คอยล์เย็น","คอยล์ร้อน","ร้านล้างแอร์","ร้านแอร์รถใกล้ฉัน", 
                # "น้ำยาแอร์ขาด", "แอร์มีแต่ลม", "ระบบปรับอากาศในรถ","ไส้กรองรถ","ยกตู้แอร์","ตู้แอร์รั่ว","สายพานแอร์","ฟิล์มกรองแสง"
                "แอร์รถยนต์", "แอร์ไม่เย็น", "ล้างแอร์", "ซ่อมแอร์รถยนต์", "ล้างแอร์ใกล้ฉัน", "ร้านซ่อมแอร์รถยนต์ใกล้ฉัน", "ล้างแอร์รถยนต์", "แอร์รถยนต์ใกล้ฉัน", "ร้านซ่อมแอร์รถใกล้ฉัน", "ซ่อมแอร์รถยนต์", 
                "ล้างแอร์รถยนต์", "แอร์รถ", "เติมน้ำยาแอร์", "กรองแอร์", "ตู้แอร์", "ล้างแอร์บ้าน", "ล้างแอร์บ้านใกล้ฉัน", "ล้างแอร์ราคาถูก300ใกล้ฉัน", "ร้านซ่อมแอร์บ้านใกล้ฉัน", "ล้างแอร์รถยนต์ใกล้ฉัน", 
                "ล้างแอร์ด่วน24ชั่วโมงใกล้ฉัน", "ซ่อมแอร์รถยนต์ใกล้ฉัน", "ร้านล้างแอร์บ้านใกล้ฉัน", "ร้านซ่อมแอร์รถยนต์", "ล้างแอร์ราคา", "แอร์รถไม่เย็น", "ร้านล้างแอร์ใกล้ฉัน", "ราคาล้างแอร์", "ล้างแอร์รถยนต์ราคา", 
                "แอร์ไม่เย็นมีแต่ลม", "แอร์ตู้", "ปรับแอร์ให้เย็น", "แอร์ตู้เคลื่อนที่", "ล้างแอร์รถยนต์ราคาบีควิก", "เติมน้ำยาแอร์ราคา", "วิธีปรับแอร์ให้เย็น", "ล้างแอร์เอง", "ตู้แอร์รถยนต์", "ล้างแอร์ด้วยตัวเอง", "แอร์ไม่เย็นออกแต่ลม", 
                "ร้านซ่อมแอร์รถ", "เติมน้ำยาแอร์บ้านราคา", "แอร์รถเย็นบ้างไม่เย็นบ้าง", "แอร์ไม่เย็นเกิดจาก", "เปิดแอร์ให้เย็น", "วิธีเปิดแอร์ให้เย็น", "คอมแอร์ไม่ตัด", "คอมแอร์ไม่ทำงาน", "คอมแอร์ไม่ทำงาน", "คอมแอร์ไม่ทำงานพัดลมไม่หมุน", 
                "คอมแอร์ไม่หมุน", "ซ่อมแอร์บ้าน", "น้ำยาแอร์รถยนต์", "ผ้ายางคลุมล้างแอร์", "รถยนต์แอร์ไม่เย็น", "ล้างแอร์บ้าน", "ล้างแอร์เอง", "ล้างแอร์รถใกล้ฉัน", "วิธีล้างแอร์", "แอร์มีแต่ลม", "แอร์เป็นน้ำแข็ง", "แอร์เป็นน้ำแข็ง", 
                "แอร์ไดกิ้นไม่เย็น", "แอร์ไม่เย็นมีแต่ลมคอมทำงาน", "แอร์ไม่เย็นมีแต่ลมคอมไม่ทำงาน", "แอร์ไม่เย็นมีแต่ลมคอมเพรสเซอร์ไม่ทำงาน", "แอร์ไม่ค่อยเย็นมีแต่ลม", "แอร์รั่ว", "ร้านล้างแอร์", "ล้างแอร์ด่วน", "ล้างแอร์ราคาถูกใกล้ฉัน", 
                "ล้างแอร์อ่อนนุช", "ล้างแอร์คอนโด", "scgล้างแอร์", "ล้างแอร์รามอินทรา", "ล้างแอร์ด่วนใกล้ฉัน", "ล้างแอร์พระราม2", "บริษัทล้างแอร์", "ล้างแอร์scg", "ล้างแอร์พระราม3", "กรองแอร์รถยนต์", "ล้างแอร์พัฒนาการ", "ล้างแอร์นวมินทร์", 
                "ล้างแอร์24ชั่วโมง", "ล้างแอร์พระราม9", "ล้างแอร์บ้านราคา", "ล้างแอร์อุดมสุข", "ล้างแอร์ด่วน24ชั่วโมง", "ราคาล้างแอร์รถยนต์", "ล้างแอร์รามคำแหง", "qchangล้างแอร์", "แผ่นกรองแอร์", "ล้างแอร์โชคชัย4", "hippol้างแอร์", 
                "ล้างแอร์โรงงาน", "ซ่อมแอร์รถยนต์ราคา", "ล้างแอร์ราคาถูก", "ราคาล้างแอร์บ้าน", "ล้างแอร์ประชาอุทิศ", "แอร์ตู้ตั้งพื้น", "ล้างแอร์4ทิศทางราคา", "ฮิปโปล้างแอร์", "ล้างแอร์ราคาเท่าไหร่", "ล้างแอร์บ้านราคาเท่าไหร่", "ซ่อมแอร์รั่วราคา", 
                "ล้างแอร์ซ่อมแอร์", "ราคาล้างแอร์4ทิศทาง", "ราคาล้างแอร์แขวน", "ล้างแอร์หทัยราษฎร์", "ราคาล้างแอร์มาตรฐาน", "ล้างแอร์4ทิศทาง", "บริษัทล้างแอร์ใกล้ฉัน", "ล้างแอร์ไดกิ้น", "แอร์ตู้ตั้งพื้นcarrier", "แอร์lgไม่เย็น", "ล้างแอร์แขวนราคา", 
                "ล้างแอร์เมืองทอง", "ซ่อมแอร์รั่ว", "แอร์รั่วซ่อมหรือซื้อใหม่", "ล้างแอร์ใกล้บ้านฉัน", "ราคาซ่อมแอร์รถยนต์", "ล้างแอร์daikin", "ร้านรับล้างแอร์ใกล้ฉัน", "ร้านล้างแอร์บ้าน", "ตู้แอร์เคลื่อนที่", "ล้างแอร์powerbuy", "ล้างแอร์ฝังฝ้า", "ล้างแอร์ฮิปโป", 
                "ล้างแอร์รถยนต์ไม่ถอดตู้ราคา", "ล้างแอร์บ้านแบบถอด", "ล้างแอร์รถยนต์ราคาเท่าไหร่", "แผ่นกรองฝุ่นแอร์", "ล้างแอร์เท่าไหร่", "ล้างแอร์รถยนต์เท่าไหร่", "แผ่นกรองอากาศแอร์", "ฟิลเตอร์กรองฝุ่นแอร์", "ไส้กรองแอร์รถยนต์", "ซ่อมรั่วแอร์r32ราคา", 
                "daikinล้างแอร์", "ล้างแอร์ไทวัสดุ", "ซ่อมรั่วแอร์ราคา", "เติมน้ำยาแอร์บ้าน", "ล้างแอร์แขวน", "powerbuyl้างแอร์", "กรองแอร์รถยนต์ราคา", "แอร์รั่วซ่อมเท่าไหร่", "โปรโมชั่นล้างแอร์", "ล้างแอร์ใหญ่", "ช่างแอร์รถยนต์ใกล้ฉัน", 
                "แผ่นฟิลเตอร์แอร์", "ล้างแอร์มิตซูบิชิ", "ราคากรองแอร์รถยนต์", "ร้านเติมน้ำยาแอร์บ้านใกล้ฉัน", "ล้างแอร์แบบถอดหมดราคา", "ล้างแอร์lg", "ล้างแอร์400บาท", "รถแอร์ไม่เย็นมีแต่ลม", "แอร์บ้านไม่เย็น", "แผ่นกรองอากาศแอร์บ้าน", 
                "แอร์ตู้คอนโทรล", "แอร์ไม่เย็นออกแต่ลมรถยนต์", "ผ้ายางล้างแอร์", "ร้านล้างแอร์รถยนต์ไม่ถอดตู้", "ทำแอร์รถยนต์ใกล้ฉัน", "แผ่นกรองแอร์panasonic", "เติมน้ำยาแอร์ใกล้ฉัน", "airproล้างแอร์รถยนต์ไม่ถอดตู้delivery", "centralairไม่เย็น", 
                "r22เติมเท่าไหร่", "r32เติมเท่าไหร่", "กรองฝุ่นแอร์", "กรองอากาศแอร์", "กรองอากาศแอร์รถ", "กรองอากาศแอร์รถยนต์", "กรองแอร์civicfd", "กรองแอร์dmax", "กรองแอร์fortuner", "กรองแอร์isuzudmax2005", "กรองแอร์กรองอากาศ", 
                "กรองแอร์นาวาร่า", "กรองแอร์บ้าน", "กรองแอร์ฟอร์จูนเนอร์", "กรองแอร์รถ", "กรองแอร์รถตู้commuter", "กรองแอร์รถยนต์honda", "กรองแอร์รถยนต์toyota", "กรองแอร์ราคา", "กรองแอร์หลังfortuner", "กรองแอร์ไทรทัน", "กันยงล้างแอร์", 
                "การล้างแอร์รถยนต์", "การเติมน้ำยาแอร์", "การเติมน้ำยาแอร์r22", "การเติมน้ำยาแอร์r32", "คอมแอร์ทำงานแต่พัดลมไม่หมุน", "คอมแอร์ทำงานแต่ไม่เย็น", "คอมแอร์บ้านไม่ทำงาน", "คอมแอร์ร้อน", "คอมแอร์ร้อนจัด", "คอมแอร์ร้อนแล้วตัด", 
                "คอมแอร์เสีย", "คอมแอร์ไม่ตัดทำงานตลอด", "คอมแอร์ไม่ติด", "คอมแอร์ไม่ทำงานมีแต่ลม", "คอมแอร์ไม่ทำงานเกิดจาก", "คอมแอร์ไม่ทำงานแอร์ไม่เย็น", "คอมแอร์ไม่สตาร์ท", "คอมเพรสเซอร์ตู้เย็นสตาร์ทไม่ออก", "คอมเพรสเซอร์เสีย", 
                "คอมเพรสเซอร์แอร์บ้านเสีย", "คอมเพรสเซอร์แอร์รั่ว", "คอมเพรสเซอร์แอร์เสีย", "คอมเพรสเซอร์ไม่ทำงาน", "คอมเพรสเซอร์ไม่ทำงาน", "คอยร้อนไม่ทำงาน", "คอยเย็นรั่ว", "คอยแอร์รั่ว", "คอยล์ร้อนdaikininverterไม่ทำงาน", "คอยล์ร้อนรั่ว", 
                "คอยล์ร้อนแอร์เสียงดัง", "คอยล์ร้อนแอร์ไม่ตัด", "คอยล์ร้อนแอร์ไม่ทำงาน", "คอยล์ร้อนแอร์ไม่ทำงาน", "คอยล์ร้อนไม่ตัด", "คอยล์ร้อนไม่ทำงาน", "คอยล์เย็นดีแม็ก", "คอยล์เย็นแอร์รถยนต์", "คอยล์เย็นแอร์รถยนต์รั่ว", "คอยล์เย็นแอร์รถยนต์ราคา", 
                "คอยล์เย็นแอร์รั่ว", "คอยล์เย็นแอร์เป็นน้ำแข็ง", "ค่าเติมน้ำยาแอร์", "ช่างแอร์รถยนต์", "ซ่อมคอมเพรสเซอร์แอร์รถยนต์", "ซ่อมคอยล์เย็นรั่วราคา", "ซ่อมแอร์รถยนต์พระราม2byช่างแฮ๊ก", "ซ่อมแอร์รถยนต์รั่วราคา", "ซ่อมแอร์รถยนต์ราคากี่บาท", 
                "ซ่อมแอร์รถยนต์เท่าไหร่", "ซ่อมแอร์รั่วราคาpantip", "ตัดล้างแอร์", "ตั้งอุณหภูมิแอร์", "ตั้งแอร์ให้เย็น", "ตู้พัดลมแอร์", "ตู้แอร์densoแท้ราคา", "ตู้แอร์ตัน", "ตู้แอร์บ้าน", "ตู้แอร์รถยนต์ราคา", "ตู้แอร์วีโก้", "ตู้แอร์แขวน", "ตู้แอร์แขวน12v", 
                "ตู้แอร์แขวนรถยนต์", "ถอดพัดลมกรงกระรอกไม่ออก", "ถอดล้างแอร์", "ถอดแอร์ล้าง", "ถังน้ำยาแอร์r22แบบเติมได้", "ถังน้ำยาแอร์แบบเติมได้", "ทำแอร์รถ", "ทำความสะอาดแอร์", "ที่กรองแอร์รถยนต์", "ท่อน้ำยาแอร์รั่ว", "ท่อแอร์รถยนต์รั่วราคา", 
                "ท่อแอร์รั่ว", "ทำแอร์จากคอยล์เย็น", "ทำแอร์รถยนต์ราคา", "น้ำแอร์รั่ว", "น้ำแอร์รั่วเกิดจาก", "น้ำยาแอร์r32เติมเท่าไหร่", "น้ำยาแอร์ขาด", "น้ำยาแอร์รถยนต์เติมเท่าไหร่", "น้ำยาแอร์รั่ว", "น้ำยาแอร์รั่วราคา", "น้ำยาแอร์รั่วอาการ", "น้ำยาแอร์รั่วเกิดจาก", 
                "น้ำยาแอร์เติมเท่าไหร่", "น้ำแข็งเกาะคอยล์เย็น", "น้ำแข็งเกาะแอร์", "น้ำยาr410aเติมเท่าไหร่", "ปรับแอร์รถให้เย็น", "ปรับแอร์รถยนต์", "ปรับแอร์ให้เย็นทั่วห้อง", "ปัญหาแอร์ไม่เย็น", "พัดลมคอมเพรสเซอร์แอร์ไม่หมุน", "พัดลมคอมเพรสเซอร์ไม่หมุน", 
                "พัดลมคอยล์เย็นหมุนช้ามิตซู", "พัดลมคอยล์เย็นหมุนช้าไดกิ้น", "พัดลมคอยล์เย็นไม่หมุนmitsubishi", "พัดลมตู้แอร์", "พัดลมแอร์รถดัง", "พัดลมแอร์รถไม่ทำงาน", "พัดลมแอร์รถยนต์ไม่ทำงาน", "พัดลมแอร์รถยนต์ไม่ทำงานhonda", "พัดลมแอร์ไม่เย็น", 
                "พัดลมแอร์ไม่แรง", "pjแอร์รถยนต์", "ฟิลเตอร์แอร์บ้าน", "ฟิลเตอร์แอร์รถ", "ระบบแอร์รถยนต์toyota"
            ],
            "painting": [
                # "ทำสีรถ", "พ่นสีรถ", "ซ่อมสีรถ", "สีรถหลุด", "เปลี่ยนสีรถ", "เคลือบสีรถ", "ขัดสีรถ", "ซ่อมรอยขีดข่วนรถ", "พ่นสีรอบคัน", "สีรถยนต์ลอก", "ทำสีรถใหม่", "สีรถเป็นรอย", "ลบรอยขีดข่วนรถ", 
                # "ซ่อมสีรถรั่ว", "ซ่อมสีรถด่วน", "ฟื้นฟูสีรถยนต์", "เคลือบแก้วสีรถ", "ทำสีรถด่วน", "เคลือบเซรามิกสีรถ", "สีรถซีด", "ซ่อมสีรถใกล้ฉัน", "ทำสีรถราคาถูก", "พ่นสีเฉพาะจุด", "พ่นสีกันชน", 
                # "ซ่อมรอยบุบ", "ซ่อมสีรถขาว", "ซ่อมสีรถดำ", "ซ่อมสีรถเก่า", "ทำสีรถสวย", "พ่นสีรถยนต์ราคาถูก", "พ่นสีใหม่", "ซ่อมสีรถยนต์", "พ่นสีรถด่วน", "แก้ไขสีรถยนต์", "ซ่อมสีรถยนต์ด่วน", 
                # "ลบรอยบุบรถ", "ฟื้นฟูสีรถ", "สีรถยนต์แตก", "สีรถเป็นจุด", "พ่นสีรถเก่า", "พ่นสีรถใหม่", "แก้ไขรอยขีดข่วน", "พ่นสีรถมือสอง", "เคลือบเซรามิครถ", "ขัดเงารถ", "ล้างสีรถ", 
                # "เคลือบสีรถเก่า", "สีรถซีดจาง", "พ่นสีรถกระบะ", "พ่นสีรถยนต์ใหม่", "ซ่อมสีรถด่วน", "พ่นสีซ่อมรอย", "ลบรอยรถยนต์", "แก้ไขสีรถซีด", "ทำสีรถทั้งคัน", "เปลี่ยนสีรถเก่า", "ขัดสีรถยนต์", 
                # "พ่นสีรถทนทาน", "ลบรอยรอยขูด", "ทำสีรถยนต์หรู", "พ่นสีรถราคาดี", "เคลือบแก้วสีรถยนต์", "พ่นสีกันรอย", "ทำสีรถยนต์ด่วน", "ลบรอยสีหลุด", "พ่นสีรถตู้", "พ่นสีรถขนาดใหญ่", "ทำสีรถสีขาว", 
                # "ทำสีรถสีดำ", "ทำสีรถราคาย่อมเยา", "ลบรอยขูดขีด", "เคลือบเงารถยนต์", "พ่นสีกันกระแทก", "ซ่อมสีรถที่ไหนดี", "พ่นสีรถยนต์ใกล้ฉัน", "พ่นสีรถราคาดี", "ลบรอยขีดข่วนเฉพาะจุด", "ซ่อมสีรถราคาถูก", 
                # "ซ่อมสีรถที่ไหนดี", "ทำสีรถยนต์เก่า", "พ่นสีใหม่ทั้งคัน", "ลบรอยขีดข่วนเฉพาะจุด", "แก้สีรถหลุด", "สีรถเป็นรอย", "พ่นสีรถเฉพาะจุด", "ฟื้นฟูสีรถมือสอง", "ทำสีรถสวยงาม", "แก้ไขสีถลอก", "เคลือบสีรถเก่าราคา", 
                # "ทำสีรอบคัน", "พ่นสีรถด่วน", "ขัดลบรอยขูดรถ", "พ่นสีรถมือหนึ่ง", "พ่นสีซ่อมรอยด่วน"
                "ทำสีรถยนต์", "เคลือบแก้ว", "พ่นสี", "เคลือบแก้วราคา", "ทำสีรถยนต์ราคา", "เคลือบแก้วรถยนต์", "เคลือบแก้วรถยนต์ราคา", "ขัดสีรถราคา", "เคลือบสีรถ", "ขัดเคลือบสีรถราคา", "สีสเปรย์พ่นเหล็ก", "ร้านทำสีรถใกล้ฉัน", 
                "ขัดสีรถ", "ทำสีรถทั้งคันราคา", "ทำสีรถยนต์ใกล้ฉัน", "ทำสีรถยนต์ราคาถูกใกล้ฉัน", "ขัดสีรถยนต์", "สีพ่น", "เคลือบแก้วรถยนต์", "เคลือบสี", "ขัดสี", "ขัดเงา", "สีถลอก", "ราคาเคลือบแก้วรถยนต์", "ราคาเคลือบแก้ว", 
                "เคลือบแก้วเซรามิค", "เคลือบแก้วใกล้ฉัน", "เคลือบสีรถราคา", "สีพ่นอุตสาหกรรม", "เคลือบแก้วรถยนต์ราคาเท่าไหร่", "สีพ่นเหล็ก", "ขัดเคลือบสีรถ", "ขัดเคลือบสีรถใกล้ฉัน", "เคลือบแก้วเซรามิคราคาเท่าไหร่", 
                "เคลือบแก้วมอเตอร์ไซค์ใกล้ฉัน", "เคลือบแก้วเซรามิคราคา", "ทำสีรถยนต์ทั้งคันราคา", "ร้านทำสีรถ", "เคลือบแก้วกับเคลือบเซรามิค", "เคลือบแก้ว3mราคาเท่าไหร่", "สีพ่นtexture", "เคลือบแก้วรถยนต์ใกล้ฉัน", 
                "สเปรย์เคลือบแก้ว", "ร้านทำสีรถใกล้ฉันราคาถูก", "ทำสีรถเก๋งทั้งคันราคา", "ทำสีรถยนต์เฉพาะจุด", "ราคาขัดเคลือบสีรถ", "ราคาเคลือบสีรถยนต์", "สีพ่นอุตสาหกรรมtoa", "เคลือบเซรามิครถยนต์", "กระดาษทรายขัดสีรถ", 
                "ขัดสีรถลบรอย", "สีสเปรย์พ่นเหล็กกันสนิม", "ซ่อมรอยบุบรถยนต์", "ขัดเคลือบสีรถราคาเท่าไหร่", "โรงงานพ่นสีฝุ่น", "ทำสีรอบคันราคา", "ทำสีรถราคา", "เคลือบแก้วกราฟีน", "ขัดสีรถใกล้ฉัน", "เคลือบแก้วเคลือบเซรามิค", 
                "เคลือบแก้วpantip", "สีพ่นกันสนิมเหล็ก", "สีพ่นทรายtoa", "พ่นสีเหล็ก", "ทำสีรถยนต์", "เคลือบรถ", "สีพ่นเหล็กกัลวาไนซ์", "กาน่าขัดรถ", "รถเคลือบแก้ว", "cana ขัดสีรถ", "wash a matter สาขาพระราม2", "กาน่าขัดสี", 
                "การขัดสีรถ", "การทำสีรถ", "การทำสีรถยนต์", "การพ่นสี", "ขนแกะขัดเงา", "ขัดขี้ไคลรถ", "ขัดรถ", "ขัดรอยขนแมว", "ขัดรอยรถ", "ขัดลบรอย", "ขัดลบรอยขนแมว", "ขัดลบรอยรถ", "ขัดสีมอเตอร์ไซค์", "ขัดสีรถด้วยตัวเอง", 
                "ขัดสีรถทั้งคันราคา", "ขัดสีรถราคาเท่าไหร่", "ขัดสีรถลบรอยขูด", "ขัดสีรถลบรอยขูดpantip", "ขัดสีรถลบรอยขูดราคา", "ขัดสีรถลบรอยราคา", "ขัดสีลบรอย", "ขัดเคลือบสี", "ขัดเคลือบสีรถยนต์ใกล้ฉัน", "ขัดเงารถ", "ค่าทำสีรถราคา", 
                "ซ่อมรอยบุบรถยนต์ไม่ต้องทำสี", "ซ่อมรอยบุบลักยิ้มรถยนต์", "ซ่อมรอยบุบลักยิ้มรถยนต์โดยไสวมือเทพ", "ซ่อมรอยลักยิ้ม", "ซ่อมรอยลักยิ้มรถ", "ซ่อมลักยิ้มรถ", "ทำสีรถทั้งคัน", "ทำสีรถทั้งคันราคา", "ทำสีรถมอไซ", "ทำสีรถมอไซค์", 
                "ทำสีรถยนต์ราคา", "ทำสีรถเอง", "ทำสีรถใกล้ฉัน", "ทำสีรถใหม่", "ที่พ่นสี", "ที่พ้นสี", "ทำสีกรอบรถราคา", "ทำสีประตูรถ1บานราคา", "ทำสีประตูรถราคา", "ทำสีรถมอไซค์", "ทำสีรถมอเตอร์ไซค์เอง", "ทำสีรถราคาเฉพาะจุด", 
                "ทำสีรถยนต์ทั้งคัน", "ทำสีรถยนต์รอบคันราคา", "ทำสีรถยนต์ราคาบางจุด", "ทำสีรถยนต์ใหม่ทั้งคันราคา", "ปัดเงา", "พ่นสีสเปรย์", "ยาขัดเงา", "ราคาขัดสีรถ", "ราคาทำสีรถ", "ราคาทำสีรถยนต์", "ราคาทำสีรถ", "ราคาทำสีรถเก๋งทั้งคัน", 
                "ราคาทำสีรถยนต์ต่อตัว", "ราคาทำสีรถยนต์ทั้งคัน", "ร้านซ่อมสีรถยนต์", "ร้านทำสีรถยนต์", "ร้านทำสีรถใกล้ฉัน", "ร้านทำสีรถยนต์mgarage", "ร้านทำสีรถ", "ร้านพ่นสีรถ", "ลบรอยขนแมวรถ", "วิธีทำสีรถ", "วิธีทำสีรถยนต์", 
                "สเปรย์พ่นเหล็ก", "สเปรย์เคลือบเงา3mpantip", "สีพ่นtoa", "สีพ่นรองพื้น", "สีพ่นอุตสาหกรรมtoasสีขาว", "สีพ่นเฟอร์นิเจอร์", "สีพ่นเมทัลชีท", "สีพ่นเหล็กกันสนิม", "สีพ้นเหล็ก", "สีสเปรย์leylandใกล้ฉัน", "สีสเปรย์leylandไทวัสดุ", 
                "สีอุตสาหกรรมtoa", "สีไฟฟ้า", "เก็บสีรอบคันราคา", "เคลือบสีรถคือ", "เคลือบสีรถใกล้ฉัน", "เคลือบเงารถราคา", "เคลือบเซรามิคกับเคลือบแก้ว", "เคลือบแก้วกราฟีนpantip", "เคลือบแก้วคือ", "เคลือบแก้วรถยนต์ข้อดีข้อเสีย", 
                "แลคเกอร์เคลือบสีรถลอก", "เคาะรอยบุบ", "เคลือบแก้วพระราม2", "เคลือบแก้วราคาเท่าไหร่", "เคลือบแก้วราคา2022", "เคลือบแก้วราคาถูก", "เคลือบแก้วศรีนครินทร์", "เคลือบแก้วราคาประหยัด", "ราคาเคลือบแก้วรถเก๋ง", 
                "เคลือบแก้วรามอินทรา", "เคลือบแก้วเซรามิคใกล้ฉัน", "เคลือบเซรามิค10hราคา", "เคลือบแก้วราชพฤกษ์", "เคลือบเซรามิครถยนต์ราคา", "สีพ่นสแตนเลสbeepaint", "ราคาเคลือบแก้วรถกระบะ4ประตู", "ขัดสีเคลือบแก้วราคา", 
                "ราคาเคลือบแก้วเซรามิค", "เคลือบแก้วพระราม3", "ขัดเคลือบแก้วราคา", "สีพ่นทรายผนัง", "แอร์บรัชพ่นสี", "เคลือบแก้วเทพารักษ์", "โปรโมชั่นเคลือบแก้ว", "ขัดสีรถราคา2565", "การเคลือบแก้วรถยนต์", "ฟิล์มเคลือบสีรถยนต์", 
                "3mกับmeguiar's", "3mขัดรถ", "3mขัดรถยนต์", "รอยขนแมว", "rtrx3m", "เคลือบแก้วฟิล์มรถยนต์", "เคลือบแก้วมีอะไรบ้าง", "รับทำเคลือบแก้ว", "ขัดเคลือบแก้ว", "กราฟีนเคลือบรถ", "ผงขัดรถ", "ประกันเคลือบแก้ว", 
                "ราคาเคลือบสีรถ", "ราคาเคลือบแก้ว", "ราคาเคลือบแก้วรถยนต์", "ซ่อมสีรถยนต์", "ซ่อมรอยบุบ", "บำรุงรักษารถยนต์", "ซ่อมสีรถ", "ราคาซ่อมสีรถ", "ทำสีรอบคัน", "บริการทำสีรถ", "บริการขัดรถ", "บริการพ่นสี", "บริการเคลือบแก้ว", 
                "บริการเคลือบสี", "บริการเคลือบเซรามิค", "บริการซ่อมสี", "บริการซ่อมรถยนต์", "บริการทำสีรถยนต์", "พ่นสีโรงงาน", "เคลือบสีโรงงาน", "เคลือบสีรถยนต์", "เคลือบสี", "เคลือบแก้วเซรามิค", "เคลือบสีเซรามิค", "ขัดสีรถยนต์", 
                "ซ่อมสีรถ", "พ่นสีรถ", "ทำสีรถยนต์", "เคลือบสีรถยนต์", "ซ่อมสี", "ทำสี", "ทำสีรถ", "ขัดสีรถ", "เคลือบสีรถ", "เคลือบสีรถยนต์", "เคลือบเซรามิค", "ทำสีรถ", "ซ่อมสีรถยนต์", "ทำสีรถยนต์", "พ่นสีรถยนต์", "ขัดสีรถยนต์", 
                "เคลือบแก้ว", "เคลือบเซรามิค", "เคลือบแก้วเซรามิค", "บริการซ่อมสีรถ", "ราคาเคลือบแก้วรถ", "ราคาเคลือบแก้วรถยนต์", "ราคาเคลือบแก้ว", "บริการทำสีรถยนต์", "บริการขัดสีรถ", "บริการพ่นสีรถ", "บริการเคลือบสีรถ", 
                "บริการซ่อมสีรถยนต์"
                ],
            "film": [
                # "ฟิล์มรถยนต์", "ฟิล์มกรองแสง", "ฟิล์มเซรามิค", "ฟิล์มกันรอย", "ฟิล์มกันความร้อน", "ฟิล์มรถยนต์ใส", "ฟิล์มติดรถ", "ฟิล์มรถดำ", "ฟิล์มรถกันแดด", "ฟิล์มลดความร้อน", "ฟิล์มกันยูวี", "ฟิล์มใสกันรอย", "ฟิล์มดำ", 
                # "ฟิล์มกระจกรถ", "ฟิล์มหน้ารถ", "ฟิล์มรถมืด", "ฟิล์มรถถูก", "ฟิล์มติดง่าย", "ฟิล์มติดดี", "ฟิล์มรถแสงน้อย", "ฟิล์มรถหรู", "ฟิล์มลดแสง", "ฟิล์มรถสะท้อน", "ฟิล์มลดยูวี", "ฟิล์มรถหน้ามืด", "ฟิล์มบานหน้า", "ฟิล์มหลังรถ", 
                # "ฟิล์มเซรามิคราคา", "ฟิล์มลดร้อน", "ฟิล์มรถคุณภาพ", "ฟิล์มรถใสกันรอย", "ฟิล์มกันรอยดี", "ฟิล์มติดทน", "ฟิล์มติดรถคุณภาพ", "ฟิล์มติดรถกันยูวี", "ฟิล์มรถหน้าดำ", "ฟิล์มรถกลางวัน", "ฟิล์มรถร้อน", "ฟิล์มรถสะท้อนแสง", 
                # "ฟิล์มลดรังสี", "ฟิล์มติดกระจกดี", "ฟิล์มรถสะท้อนยูวี", "ฟิล์มรถประหยัด", "ฟิล์มรถไม่สะท้อน", "ฟิล์มรถเย็น", "ฟิล์มรถทึบ", "ฟิล์มรถติดง่าย", "ฟิล์มรถติดดี", "ฟิล์มรถบังแดด", "ฟิล์มรถกันร้อน", "ฟิล์มรถสีใส", "ฟิล์มรถกันแดดดี", 
                # "ฟิล์มรถป้องกัน", "ฟิล์มติดรถสะท้อน", "ฟิล์มกระจกใส", "ฟิล์มรถหายร้อน", "ฟิล์มรถแสงดี", "ฟิล์มรถหรูหรา", "ฟิล์มรถป้องกันรังสี", "ฟิล์มกันแดด", "ฟิล์มรถใสติดง่าย", "ฟิล์มรถใสดี", "ฟิล์มรถยนต์สะท้อน", "ฟิล์มรถกันความร้อนดี", 
                # "ฟิล์มติดรถสะท้อนยูวี", "ฟิล์มติดรถเซรามิค", "ฟิล์มรถคุณภาพดี", "ฟิล์มรถกันรอยขูด", "ฟิล์มกันแดดรถ", "ฟิล์มรถลดร้อน", "ฟิล์มรถกันรอยดี", "ฟิล์มรถเงา", "ฟิล์มรถลบรอย", "ฟิล์มรถยนต์คุณภาพสูง", "ฟิล์มรถหรูราคา", "ฟิล์มรถเงางาม", 
                # "ฟิล์มรถหน้าร้อน", "ฟิล์มรถลดแสงสะท้อน", "ฟิล์มรถแสงทึบ", "ฟิล์มรถคุณภาพดี", "ฟิล์มรถสะท้อนดี", "ฟิล์มรถบานหลัง", "ฟิล์มรถลดแสงสะท้อนยูวี", "ฟิล์มรถสีเทา", "ฟิล์มรถสะท้อนเย็น", "ฟิล์มรถกันรังสี", "ฟิล์มรถเย็นดี", "ฟิล์มรถแสงดี", 
                # "ฟิล์มรถป้องกันรังสีความร้อน", "ฟิล์มรถกันแสง", "ฟิล์มรถสะท้อนแดด", "ฟิล์มรถใสป้องกัน", "ฟิล์มรถยนต์สะท้อนรังสี", "ฟิล์มรถลดร้อนดี", "ฟิล์มรถป้องกันดี", "ฟิล์มรถยนต์ป้องกันแดด"
                "ติดฟิล์มรถยนต์", "ฟิล์มรถยนต์", "ร้านติดฟิล์มรถยนต์ใกล้ฉัน", "ติดฟิล์มรถยนต์ใกล้ฉัน", "ติดฟิล์มรถใกล้ฉัน", "ฟิล์มกรองแสง", "ฟิล์มกันรอย", "ร้านติดฟิล์มรถยนต์", "ติดฟิล์มกระจกบ้าน", "ติดฟิล์มรถยนต์ราคา", "ฟิล์มกระจกบ้าน", 
                "ฟิล์มติดรถยนต์", "ราคาฟิล์มรถยนต์", "ราคาติดฟิล์มรถยนต์", "ฟิล์มเซรามิคราคา", "ฟิล์มกรองแสงรถยนต์", "ฟิล์มรถยนต์ราคา", "เปลี่ยนฟิล์มรถยนต์ราคา", "ฟิล์มกระจกรถยนต์", "ติดฟิล์มรถยนต์ราคาถูกใกล้ฉัน", "เปลี่ยนฟิล์มรถยนต์", 
                "ฟิล์มรถยนต์เซรามิค", "ติดฟิล์มรถยนต์ราคา1000", "ติดฟิล์มรถยนต์4060ราคา", "ร้านฟิล์มรถยนต์ใกล้ฉัน", "ร้านติดฟิล์มรถยนต์ใกล้ฉันราคา", "ติดฟิล์มรถยนต์60รอบคันราคา", "ฟิล์มกันเสือก", "ฟิล์มรถยนต์ใกล้ฉัน", "ฟิล์มโทรศัพท์", 
                "ร้านฟิล์มรถยนต์", "ฟิล์มกระจกโทรศัพท์", "ติดฟิล์มโทรศัพท์", "ติดฟิล์มโทรศัพท์", "ติดฟิล์มมือถือ", "ติดฟิล์มรถยนต์ราคา1000", "ฟิล์มกรองแสง", "ฟิล์มกันรอย", "ฟิล์มกันเสือก", "ฟิล์มกันรอย", "ฟิล์มปรอท", "ฟิล์มเซรามิค", 
                "ฟิล์มกระจกยานยนต์", "ฟิล์มติดรถ", "ฟิล์มใส", "ฟิล์มกันความร้อน", "ติดฟิล์มกันรอยรถยนต์", "ติดฟิล์มอาคาร", "ฟิล์มกรองแสงอาคาร", "ฟิล์มอาคาร", "ฟิล์มติดอาคาร", "ฟิล์มเซรามิค3m", "ฟิล์มใสกันรอยรถยนต์", 
                "ร้านติดฟิล์มรถยนต์ราคาถูกใกล้ฉัน", "ติดฟิล์มกระจกคอนโด", "ฟิล์มติดกระจกบ้านกันความร้อน", "ติดฟิล์มรถยนต์ราคาเท่าไหร่", "ฟิล์มกันแดดบ้าน", "ฟิล์มเซรามิคHiKool", "ติดฟิล์มกันรอยรถยนต์ราคา", "ราคาฟิล์มเซรามิค", 
                "ฟิล์มกรองแสงติดกระจกบ้าน", "ฟิล์มกรองแสงบ้าน", "ร้านติดฟิล์มรถยนต์3mใกล้ฉัน", "ฟิล์มรถยนต์3m", "lamina ceramatrixราคา", "ร้านติดฟิล์มกันรอยรถยนต์ใกล้ฉัน", "ฟิล์มติดรถยนต์เซรามิค", "รับติดฟิล์มรถยนต์", "ฟิล์มติดรถยนต์ราคา", 
                "ติดฟิล์มรถยนต์ราคาถูก", "ติดฟิล์มใสกันรอยรถยนต์", "ฟิล์ม3m ceramic ultra clearราคา", "ฟิล์มกระจกรถยนต์ราคา", "ฟิล์มใสกันรอยรถยนต์ราคา", "ฟิล์มติดรถยนต์3m", "3m ceramic ultra clearราคา", 
                "ติดฟิล์มกันรอยรถยนต์ราคาเท่าไหร่", "ฟิล์มปรอทติดกระจกบ้าน", "ฟิล์มHiKoolceramic", "ติดฟิล์มเซรามิคราคา", "ร้านติดฟิล์มรถยนต์HiKoolใกล้ฉัน", "ฟิล์มลามิน่าเซรามิคราคา", "ติดฟิล์มกรองแสงบ้าน", "ติดฟิล์มกันรอยภายในรถยนต์", 
                "ฟิล์มกระจกS22 Ultra", "3m crystallineราคา", "ติดฟิล์มรถยนต์นอกสถานที่", "ฟิล์มลามิน่าเซรามิค", "ฟิล์มรถยนต์เซรามิคราคา", "ติดฟิล์มรถยนต์เซรามิคราคา", "ติดฟิล์มกันรอยรถยนต์ใกล้ฉัน", "ติดฟิล์มกันรอยรถยนต์ราคาพันทิป", 
                "ฟิล์มHiKoolเซรามิค", "ติดฟิล์มรถยนต์3m", "ฟิล์มใสกันร้อน", "ราคาฟิล์มรถยนต์3m", "ฟิล์มกันแดดติดกระจกบ้าน", "ฟิล์มกรองแสงเซรามิค", "HiKoolceramicblacknightราคา", "ฟิล์มเซรามิค3mราคา", "ร้านติดฟิล์ม", 
                "ฟิล์มลามิน่าราคา", "ติดฟิล์มรถยนต์3mราคาเท่าไหร่", "ราคาติดฟิล์มรถเก๋ง", "ฟิล์มกันความร้อนกระจกบ้าน", "ฟิล์มกรองแสงรถยนต์ราคา", "รับติดฟิล์มรถยนต์นอกสถานที่", "ติดฟิล์มภายในรถยนต์", "ฟิล์มกรองแสง3m", 
                "ราคาฟิล์มเซรามิคHiKool", "ฟิล์มติดกระจกรถยนต์", "เปลี่ยนฟิล์มรถยนต์ใกล้ฉัน", "ฟิล์มLamina", "ฟิล์มเซรามิค3mราคาเท่าไหร่", "ติดฟิล์มรถยนต์HiKoolราคา", "ติดฟิล์มรถยนต์รามอินทรา", "HiKoolceramicราคา", 
                "3mฟิล์มรถยนต์", "ติดฟิล์มรถยนต์Laminaราคา", "ติดฟิล์มบานหน้า40ราคา", "ฟิล์มเซรามิคHiKoolราคา", "ฟิล์มรถยนต์3mceramicราคา", "ติดฟิล์มเซรามิค", "ฟิล์มเซรามิคคือ", "ติดฟิล์ม3m", "ฟิล์มกันร้อน", "ฟิล์มใสกันรอย", 
                "HiKoolbeyondceramicราคา", "ฟิล์มHiKoolceramicblacknightราคา", "ฟิล์มHiKoolเซรามิคราคา", "ฟิล์ม3mtติดรถยนต์", "ฟิล์มนาโนเซรามิค", "ฟิล์มกระจกรถยนต์เซรามิค", "ฟิล์มเซรามิคHiKool60รอบคันราคา", "ฟิล์มHiKoolราคา", 
                "ติดฟิล์มรถยนต์นอกสถานที่ใกล้ฉัน", "ร้านติดฟิล์มกระจกรถยนต์ใกล้ฉัน", "ฟิล์มกันแดด", "ติดฟิล์มรถยนต์เซรามิค", "ฟิล์มเซรามิคGlasiaราคา", "ฟิล์มLaminaCeramic", "ฟิล์มเซรามิค3multraclearราคา", "ฟิล์มกันร้อนบ้าน", 
                "ติดฟิล์มรถยนต์เท่าไหร่", "ติดฟิล์มรถเก๋งราคา", "ติดฟิล์มกระจกรถยนต์", "ยี่ห้อฟิล์มรถยนต์", "ฟิล์มติดโทรศัพท์", "ฟิล์มVKoolราคา", "ราคาติดฟิล์มรถยนต์3m", "ติดฟิล์มรถยนต์รอบคันราคา", "ฟิล์มกระจกFocus", 
                "ร้านติดฟิล์มรถยนต์พระราม2", "ลามิน่าเซรามิค", "ฟิล์มSolarGard", "ฟิล์มเซรามิคHiKoolราคาเท่าไหร่", "ฟิล์มเซรามิครถยนต์", "ร้านติดฟิล์มรถยนต์ราคาถูก", "ติดฟิล์มกรองแสงรถยนต์", "ราคาฟิล์มติดรถยนต์", "ฟิล์มรถยนต์3mราคา", 
                "ราคาฟิล์มรถยนต์HiKool", "รับจ้างติดฟิล์มบ้าน", "ฟิล์มรถยนต์ราคาถูก", "ติดฟิล์มรถยนต์กระจกหน้าราคา", "ราคาฟิล์มHiKool", "ฟิล์มกันแดดรถยนต์", "ร้านเปลี่ยนฟิล์มรถยนต์ใกล้ฉัน", "ฟิล์มHiKoolเซรามิคราคา", 
                "ฟิล์มเซรามิคHiKool60รอบคัน", "ติดฟิล์มรถยนต์บานหน้าราคา", "ติดฟิล์มกระจกรถยนต์ราคา", "ติดฟิล์มรถยนต์3mราคา", "ติดฟิล์มรถยนต์เท่าไหร่ดี", "ฟิล์มกรองแสงรถยนต์เซรามิค", "ฟิล์มกันรอยโทรศัพท์", 
                "SuperHiKoolbeyondceramicราคา", "HiKoolbeyondceramic", "ฟิล์มกันแสง", "ฟิล์มกันร้อนอาคาร", "HiKoolceramicblacknight", "ฟิล์มติดรถยนต์Lamina", "ฟิล์มHiKoolเซรามิค", "ร้านติดฟิล์มรถยนต์ตลาดพูนทรัพย์", 
                "ร้านเปลี่ยนฟิล์มรถยนต์", "การติดฟิล์มรถยนต์", "ฟิล์มติดรถยนต์HiKoolเซรามิคราคา", "ราคาหมุนฟิล์มรถยนต์", "ติดฟิล์มรถยนต์HiKoolceramicราคา", "ฟิล์มGlasiaCeramic", "ฟิล์มXtraColeceramic", "ฟิล์มติดรถยนต์ใกล้ฉัน", 
                "ร้านติดฟิล์มกันรอยมอเตอร์ไซค์ใกล้ฉัน", "ติดฟิล์มกรองแสง", "ฟิล์มกันรอยFocus", "รับติดฟิล์มรถยนต์ใกล้ฉัน", "ฟิล์มนาโนเซรามิคราคา", "HiKool", "ฟิล์มใสกันร้อนรถยนต์", "ติดตั้งฟิล์มรถยนต์", "ฟิล์มกรองแสงHiKool", 
                "ฟิล์มติดกระจกกันร้อน", "ฟิล์มSolarGardราคา", "ฟิล์มรถยนต์HiKool", "HiKoolเซรามิค", "ติดฟิล์มรถกระบะแคปราคาเท่าไหร่", "ติดฟิล์มรอบคันราคา", "ร้านติดฟิล์มกระจกใกล้ฉัน", "ฟิล์มกระจกHiShield", "ฟิล์มกระจกหน้ารถยนต์ราคา", 
                "ฟิล์มรถยนต์Lamina", "ฟิล์มลามิน่าเซรามิคพันทิป", "ติดฟิล์มรถยนต์4ประตูราคา", "ร้านติดฟิล์มกระจกรถยนต์", "ฟิล์มมือถือ", "ติดฟิล์มรถยนต์6080ราคา", "ฟิล์มติดรถยนต์HiKool", "ฟิล์มกันร้อนรถยนต์", "ติดฟิล์มกระจกหน้ารถยนต์ราคา", 
                "ฟิล์มรถยนต์HiKoolราคา", "ร้านติดตั้งฟิล์มรถยนต์ใกล้ฉัน", "ติดฟิล์มรถเก๋งราคาเท่าไหร่", "ติดฟิล์มกระจกรถยนต์ใกล้ฉัน", "ฟิล์มHydrogelFocusราคา", "filmรถยนต์", "ฟิล์มกันกระแทก", "ฟิล์มกระจกFocusแท้", 
                "ฟิล์มLaminaCeramicOneราคา", "ติดฟิล์มเซรามิครถยนต์", "ฟิล์มรถยนต์มืดนอกสว่างใน", "ติดฟิล์มHiKool", "ฟิล์มรถยนต์ลามิน่า", "ร้านติดฟิล์มกรองแสงรถยนต์", "ฟิล์มHiKoolbeyondceramicราคา", "ติดฟิล์มรถยนต์Dmax4ประตูราคา", 
                "ราคาติดฟิล์มรถกระบะ4ประตู", "3mceramicultraclearพันทิป", "3mceramicultracleardีไหมพันทิป", "7coolติดฟิล์มรถยนต์", "applewatchติดฟิล์ม", "ckfilmsshop", "GlasiaCeramicHyper", "HiKoolbeyondceramicพันทิป", 
                "HiKoolceramicblacknightพันทิป", "HiKoolceramicblacknightดีไหมพันทิป", "HiKoolRseries", "HiKoolceramic", "HiShieldสาขา", "กฎหมายติดฟิล์มรถยนต์", "กันรอย", "ความเข้มฟิล์มรถยนต์", "ติดฟิล์มiPad", 
                "ติดฟิล์มiPadราคา", "ติดฟิล์มกรองแสงรถยนต์ใกล้ฉัน", "ติดฟิล์มกระจกมือถือ", "ติดฟิล์มกระจกโทรศัพท์", "ติดฟิล์มกระจกโทรศัพท์ราคา", "ติดฟิล์มกันเสือก", "ติดฟิล์มจอโค้ง", "ติดฟิล์มมือถือ", "ติดฟิล์มรถพันทิป", "ติดฟิล์มรถเอง", 
                "ติดฟิล์มรถยนต์3m", "ติดฟิล์มรถยนต์Laminaราคาพันทิป", "ติดฟิล์มหน้ารถ", "ติดฟิล์มแท็บเล็ต", "ติดฟิล์มแท็บเล็ตราคา", "ติดฟิล์มโทรศัพท์มีฟองอากาศ", "ติดฟิล์มโทรศัพท์ราคา", "ติดฟิล์มโทรศัพท์แล้วมีฟองอากาศ", 
                "ติดฟิล์มโทรศัพท์ไฮโดรเจล", "ติดฟิล์มไฟหน้ารถ", "บริษัทลีวณิชย์จำกัด", "บริษัทเทคโนเซลเฟรย์จำกัด", "ฟิล์ม60รอบคัน", "ฟิล์มBlaupunktดีไหมพันทิป", "ฟิล์มGlasiaCeramicHypers15ราคา", "ฟิล์มHiKoolbeyondceramic", 
                "ฟิล์มMasterCeramic", "ฟิล์มTPUคือ", "ฟิล์มXtraColeดีไหมพันทิป", "ฟิล์มกรองแสง3m", "ฟิล์มกรองแสงภาษาอังกฤษ", "ฟิล์มกรองแสงรถยนต์ใกล้ฉัน", "ฟิล์มกรองแสงเซรามิค7cool", "ฟิล์มกระจกFocusราคา", "ฟิล์มกระจกiPad", 
                "ฟิล์มกระจกiPhone13", "ฟิล์มกระจกSamsung", "ฟิล์มกระจกVivo", "ฟิล์มกระจกกันเสือก", "ฟิล์มกระจกกับฟิล์มไฮโดรเจล", "ฟิล์มกระจกมือถือ", "ฟิล์มกระจกรถยนต์ใกล้ฉัน", "ฟิล์มกระจกหน้ารถ"

            ],
            "mirror": [
                # "กระจกรถยนต์", "ซ่อมกระจกรถ", "เปลี่ยนกระจกรถ", "กระจกหน้าแตก", "กระจกรถร้าว", "กระจกรถเป็นรอย", "กระจกรถรั่ว", "กระจกไฟฟ้าเสีย", "ซ่อมกระจกไฟฟ้า", "กระจกมองข้างแตก", "ซ่อมกระจกหน้ารถ", "กระจกรถรั่วน้ำ", "กระจกรถไม่ขึ้น", 
                # "เปลี่ยนกระจกรถด่วน", "กระจกข้างรถแตก", "กระจกหลังรถแตก", "กระจกรถค้าง", "เปลี่ยนกระจกบังลม", "ล้างกระจกรถ", "ซ่อมกระจกข้าง", "กระจกรถยนต์รั่ว", "กระจกรถมองข้าง", "กระจกหน้ารถร้าว", "กระจกหลังรถยนต์", "กระจกข้างรถยนต์", 
                # "ซ่อมกระจกหลังรถ", "ฟิล์มติดกระจกรถ", "กระจกบังลมแตก", "ซ่อมกระจกบังลม", "กระจกรถสั่น", "กระจกรถมีเสียง", "กระจกรถลื่นไม่ดี", "ซ่อมกระจกบังลมรถ", "กระจกหน้าต่างรถยนต์", "กระจกรถยนต์กันรอย", "กระจกรถเป็นฝ้า", "เปลี่ยนกระจกข้างรถ", 
                # "กระจกบังลมร้าว", "ฟิล์มติดกระจก", "กระจกรถหน้ารถ", "เปลี่ยนกระจกไฟฟ้า", "ล้างกระจกข้าง", "กระจกรถเคลือบ", "เปลี่ยนกระจกมองข้าง", "กระจกรถเปิดไม่ขึ้น", "กระจกรถร้าวเปลี่ยน", "กระจกไฟฟ้าค้าง", "เปลี่ยนกระจกหลัง", "กระจกรถไม่ทำงาน", 
                # "ฟิล์มกันรอยกระจก", "เปลี่ยนกระจกไฟฟ้ารถยนต์", "กระจกรถหน้าต่าง", "เปลี่ยนกระจกหน้ารถด่วน", "กระจกหลังรถร้าว", "ฟิล์มกระจกรถยนต์", "กระจกบังลมหลัง", "กระจกรถไฟฟ้า", "กระจกไฟฟ้ารถ", "กระจกรถราคาถูก", "ฟิล์มป้องกันรอย", "กระจกรถยนต์เปิดไม่ได้", 
                # "เปลี่ยนกระจกข้างด่วน", "กระจกรถฟิล์ม", "ซ่อมกระจกไฟฟ้ารถยนต์", "ฟิล์มติดกระจกรถยนต์", "ซ่อมกระจกรถใกล้ฉัน", "กระจกรถร้าวเล็ก", "ซ่อมกระจกหน้ารถด่วน", "กระจกบังลมซ่อม", "กระจกข้างร้าว", "กระจกรถมองข้างแตก", "ซ่อมกระจกไฟฟ้ารถยนต์ด่วน", 
                # "กระจกหลังรถไม่ทำงาน", "ฟิล์มป้องกันกระจกรถ", "กระจกรถยนต์ซ่อมได้", "กระจกรถไฟฟ้าไม่ทำงาน", "กระจกหน้ารถร้าวเปลี่ยน", "เปลี่ยนกระจกรถข้าง", "กระจกรถไฟฟ้าร้าว", "กระจกไฟฟ้าขึ้นช้า", "ฟิล์มกระจกหลัง", "กระจกรถยนต์ใส", "ซ่อมกระจกบังลมด่วน", 
                # "ฟิล์มป้องกันรอยขีดข่วน", "เปลี่ยนกระจกรถยนต์", "กระจกหน้ารถเป็นฝ้า", "ซ่อมกระจกรถรั่ว", "กระจกข้างรถเปิดไม่ได้", "กระจกรถร้าวซ่อม", "กระจกบังลมหลังแตก", "ฟิล์มกระจกรถดี", "ฟิล์มติดกระจกหลัง", "กระจกหลังรถไม่ขึ้น", "กระจกรถเปิดไม่ติด", 
                # "กระจกรถกันรอย", "เปลี่ยนกระจกรถแตก", "กระจกบังลมไม่ทำงาน", "ฟิล์มติดกระจกรถหน้า", "กระจกหลังรถยนต์ร้าว", "กระจกบังลมหลังแตก", "กระจกรถเคลือบแก้ว"
                "กระจกรถยนต์", "กระจกแตก", "กระจกร้าว", "กระจกนิรภัย", "เปลี่ยนกระจกรถยนต์ราคา", "เปลี่ยนกระจกรถยนต์", "กระจกเทมเปอร์", "เปลี่ยนกระจกรถยนต์ใกล้ฉัน", "กระจกรถยนต์ใกล้ฉัน", "บางนาออโต้กลาส", 
                "กระจกหน้ารถ", "กระจกหน้ารถยนต์", "เปลี่ยนกระจก", "กระจกรถยนต์ราคา", "เปลี่ยนกระจกหน้ารถยนต์ราคา", "ราคากระจกรถยนต์", "เปลี่ยนกระจกรถยนต์ศูนย์โตโยต้าราคา", "กระจกหน้ารถราคา", "กระจกนิรภัยราคา", 
                "กระจกนิรภัยเทมเปอร์", "ราคากระจกหน้ารถยนต์", "เปลี่ยนกระจกรถยนต์ศูนย์ฮอนด้าราคา", "เปลี่ยนกระจกรถยนต์ราคาที่ไหน", "เปลี่ยนกระจกหน้ารถยนต์", "เปลี่ยนกระจกหน้ารถยนต์นิสสันราคา", "ราคาเปลี่ยนกระจกรถยนต์", 
                "ติดตั้งกระจกรถยนต์", "ราคากระจกหน้ารถยนต์toyotavigoราคา", "กระจกหน้ารถยนต์ราคา", "กระจกเทมเปอร์", "กระจกเทมเปอร์ลามิเนต", "ราคากระจกนิรภัย", "กระจกนิรภัยราคาตารางเมตรละ", "เปลี่ยนกระจกหน้ารถยนต์ราคาที่ไหน", 
                "lgกระจกรถยนต์", "กระจกtemperedglass", "กระจกtemperedราคา", "กระจกกึ่งนิรภัย", "กระจกนิรภัยคือ", "กระจกรถcom", "กระจกรถร้าว", "กระจกรถแตกเอง", "กระจกรถยนต์ราคาที่ไหน", "กระจกรถยนต์หน้าราคา", 
                "กระจกรถยนต์โดนหิน", "กระจกหน้าริโวแท้", "กระจกหน้ารถเป็นรอยร้าว", "กระจกหลังรถยนต์ราคา", "กระจกเทมเปอร์คือ", "กระจกเทมเปอร์แตก", "ติดกระจกรถ", "ติดตั้งกระจกรถยนต์ใกล้ฉัน", "ทำกระจกรถยนต์ใกล้ฉัน", 
                "มาตรฐานกระจกรถยนต์", "ราคากระจกรถยนต์", "ราคากระจกหน้ารถ", "ราคากระจกหน้ารถยนต์honda", "ราคากระจกหน้ารถยนต์toyotarevo", "อุดมสุขกระจกรถยนต์", "เปลี่ยนกระจกประตูรถยนต์ราคา", 
                "เปลี่ยนกระจกรถยนต์ด้านข้างราคา", "เปลี่ยนกระจกรถยนต์ศูนย์isuzurราคา", "เปลี่ยนกระจกหน้ารถราคาที่ไหน", "เปลี่ยนกระจกหลังรถยนต์ราคา", "เมืองทองกระจกรถยนต์", "เอเอสกระจกรถยนต์", "เปลี่ยนกระจกข้าง", 
                "เปลี่ยนกระจกรถยนต์ราคาถูก", "โรงงานกระจกเทมเปอร์", "รับเปลี่ยนกระจกรถยนต์นอกสถานที่", "กระจกรถยนต์รามอินทรา", "กระจกลามิเนตกับกระจกเทมเปอร์ราคา", "ราคากระจกรถยนต์isuzubánหน้า", "เปลี่ยนกระจกรถยนต์นอกสถานที่", 
                "เปลี่ยนกระจกหน้ารถยนต์fordrangerราคา", "เปลี่ยนกระจกหน้า", "temperedglassแตก", "tsgกระจก", "wwwกระจกรถcom", "กระจก2ชั้นรถยนต์", "กระจกheatstrengthen", "กระจกtemperlaminate", "กระจกtemperคือ", 
                "กระจกtemperหนา", "กระจกtemperแตก", "กระจกtemperedglassคือ", "กระจกtemperedglassราคา", "กระจกtemperedlaminated", "กระจกtsg", "กระจกtsgกับagc", "กระจกกรองแสงรถยนต์", "กระจกกลมติดรถ", 
                "กระจกกลมรถยนต์", "กระจกกึ่งนิรภัยคือ", "กระจกข้างรถยนต์ไม่ทำงาน", "กระจกด้านหน้ารถยนต์", "กระจกตัดแสงรถยนต์", "กระจกติดข้างรถ", "กระจกที่แตกเป็นเม็ดข้าวโพด", "กระจกธรรมดา", "กระจกธรรมดากับกระจกนิรภัย", 
                "กระจกนิรภัย2ชั้น", "กระจกนิรภัยtemperedglass", "กระจกนิรภัยกันกระสุน", "กระจกนิรภัยกันกระสุนราคา", "กระจกนิรภัยกันขโมย", "กระจกนิรภัยกับกระจกธรรมดา", "กระจกนิรภัยบ้าน", "กระจกนิรภัยบ้านราคา", "กระจกนิรภัยรถยนต์", 
                "กระจกนิรภัยรถยนต์ราคา", "กระจกนิรภัยราคาpantip", "กระจกนิรภัยลามิเนต", "กระจกนิรภัยลามิเนตราคา", "กระจกนิรภัยสเตนกลาส", "กระจกนิรภัยหนา", "กระจกนิรภัยเทมเปอร์ราคา", "กระจกนิรภัยแตก", 
                "กระจกบานหน้าfordrangerราคา", "กระจกบานหน้า hondacityราคา", "กระจกบานหน้า isuzu", "กระจกบานหน้าisuzurราคา", "กระจกบานหน้าคนิสสันมาร์ชราคา", "กระจกบานหน้ารถตู้ราคา", "กระจกบานหน้ารถยนต์", 
                "กระจกบานหน้ารถยนต์ราคา", "กระจกบานหน้าวีโก้", "กระจกบานหน้าวีโก้ราคา", "กระจกบานหน้าวีโก้ราคาเท่าไหร่", "กระจกบานเลื่อนรถยนต์", "กระจกบานเลื่อนรถยนต์ราคา", "กระจกบ้านนิรภัย", "กระจกบ้านนิรภัยราคา", 
                "กระจกประตูรถยนต์ราคาที่ไหน", "กระจกประตูรถยนต์เปิดไม่ได้", "กระจกประตูรถยนต์แตก", "กระจกประตูรถยนต์ไม่ขึ้น", "กระจกประตูรถยนต์ไม่เลื่อน", "กระจกมองข้างรถยนต์แตก", "กระจกมองข้างรถยนต์ไม่ทำงาน", 
                "กระจกมองหลังรถยนต์ตัดแสง", "กระจกมองหลังรถยนต์หลุด", "กระจกยนต์", "กระจกรถbmwราคา", "กระจกรถนิรภัย", "กระจกรถบานหน้าราคา", "กระจกรถยนต์", "กระจกรถร้าวเกิดจาก", "กระจกรถหลุด", "กระจกรถเก๋งราคา", 
                "กระจกรถแตกราคา", "กระจกรถยนต์2ชั้น", "กระจกรถยนต์2ชั้นราคา", "กระจกรถยนต์agc", "กระจกรถยนต์bmw", "กระจกรถยนต์saintgobainsekurit", "กระจกรถยนต์tsg", "กระจกรถยนต์กดลงแล้วกดขึ้นไม่ได้", 
                "กระจกรถยนต์กดไม่ได้", "กระจกรถยนต์ขึ้นไม่ได้", "กระจกรถยนต์ติด", "กระจกรถยนต์ปิดไม่ขึ้น", "กระจกรถยนต์ยี่ห้อ", "กระจกรถยนต์รามคำแหง", "กระจกรถยนต์วรจักร", "กระจกรถยนต์ศรีนครินทร์", "กระจกรถยนต์สองชั้น", 
                "กระจกรถยนต์สั่งตัด", "กระจกรถยนต์อัลฟ่าร์", "กระจกรถยนต์เป็นสีรุ้ง", "กระจกรถยนต์เลื่อนขึ้นไม่ได้", "กระจกรถยนต์เสีย", "กระจกรถยนต์แท้", "กระจกร้าวซ่อมหรือเปลี่ยน", "กระจกลามิเนต3 3", "กระจกลามิเนต6 6", 
                "กระจกลามิเนตกับกระจกเทมเปอร์", "กระจกลามิเนตข้อเสีย", "กระจกลามิเนตความหนา", "กระจกลามิเนตหนา", "กระจกลามิเนตเทมเปอร์", "กระจกลามิเนตแตก", "กระจกลามิเนตใส", "กระจกวงกลมติดรถ", "กระจกหน้าฟอร์ดเรนเจอร์", 
                "กระจกหน้าฮอนด้าซิตี้ราคา", "กระจกหน้าริโวราคา", "กระจกหน้าริโวแท้ราคา", "กระจกหน้าซูซูกิสวิฟท์ราคา", "กระจกหน้าวีโก้", "กระจกหน้ารถวิโอสราคาเท่าไหร่", "กระจกหน้ารถนิสสันมาร์ชราคา", "กระจกหน้ารถฮอนด้าซิตี้ราคา", 
                "กระจกหน้ารถisuzudmax", "กระจกหน้ารถวีโก้"

            ],
        }

        selected_category = category_var.get()

        if include_fixed.get() and selected_category in fixed_words:  # Only include fixed words if the checkbox is checked
            # Add fixed words to the result string first
            for word in fixed_words[selected_category]:
                if len(result_string) + len(word) + 2 <= desired_length:  # +2 for ", "
                    result_string += word + ", "

        # Use the word list corresponding to the selected category
        if selected_category in word_lists:
            words = word_lists[selected_category]
        else:
            words = []

        # Randomly select words and concatenate them with ", " until the desired length is reached
        while len(result_string) < desired_length and words:
            random_word = random.choice(words)
            if len(result_string) + len(random_word) + 2 <= desired_length:  # +2 for ", "
                result_string += random_word + ", "
            else:
                break
        
    

        # If the loop ends and the string is slightly shorter, fill with characters from another word
        if len(result_string) < desired_length and words:
            additional_chars = random.choice(words)[:desired_length - len(result_string)]
            result_string += additional_chars

        # Remove the trailing comma and space if necessary
        result_string = result_string.strip(', ')

        # Display the result in the text widget with word wrapping
        text_result.config(state=tk.NORMAL)
        text_result.delete(1.0, tk.END)
        text_result.insert(tk.END, result_string)
        text_result.config(state=tk.DISABLED)
        label_length.config(text=f"Total length: {len(result_string)}")
        
    except ValueError:
        tk.messagebox.showerror("Invalid input", "Please enter a valid number.")

def copy_to_clipboard():
    """Copies the selected text to the clipboard."""
    try:
        selected_text = text_result.get(tk.SEL_FIRST, tk.SEL_LAST)
        root.clipboard_clear()
        root.clipboard_append(selected_text)
    except tk.TclError:
        pass  # No text selected

def show_context_menu(event):
    """Displays the right-click context menu."""
    context_menu.post(event.x_root, event.y_root)

# Create the main window
root = tk.Tk()
root.title("Keyword Generator")

# Custom font settings for Thai text
custom_font = tkfont.Font(family="Tahoma", size=12)

# Create and place the input field for the desired length
label_prompt = tk.Label(root, text="Enter the str length :", font=custom_font)
label_prompt.pack(pady=10)

entry_length = tk.Entry(root, font=custom_font)
entry_length.pack(pady=5)

# Create a dropdown list for categories
category_var = tk.StringVar()
category_dropdown = ttk.Combobox(root, textvariable=category_var, font=custom_font)
category_dropdown['values'] = (values)
category_dropdown.current(0)  # Set default value
category_dropdown.pack(pady=5)

# Create a checkbox to include or exclude fixed words
include_fixed = tk.BooleanVar()
include_fixed.set(False)  # Ensure the checkbox is not selected by default
checkbox_fixed = tk.Checkbutton(root, text="Include fixed words", variable=include_fixed)
checkbox_fixed.pack(pady=5)

# Create and place the button to generate the random string
button_generate = tk.Button(root, text="Generate", command=generate_random_string, font=custom_font)
button_generate.pack(pady=10)

# Create and place a text widget to display the result
text_result = tk.Text(root, height=10, width=50, padx=20, pady=10, font=custom_font, wrap=tk.WORD)
text_result.pack(pady=10)

# Create a context menu for the text widget
context_menu = tk.Menu(root, tearoff=0)
context_menu.add_command(label="Copy", command=copy_to_clipboard)

# Bind the right-click event to show the context menu
text_result.bind("<Button-3>", show_context_menu)

# Create and place a label to show the length of the generated string
label_length = tk.Label(root, text="Total length: 0", font=custom_font)
label_length.pack(pady=5)

# Start the main event loop
root.mainloop()
